question_sets = [
  ['Основное желание', '', [
    [1, 'В своей жизни больше всего я стремлюсь к целостности, перфекционичности'],
    [1, 'Честность и объективность чрезвычайно важны для меня'],
    [1, 'В своей погоне за идеалами временами я перегибаю палку и становлюсь ужасным перфекционистом'],
    [2, 'В своей жизни больше всего я стремлюсь к чувству любви'],
    [2, 'Мой образ любящего и заботливого человека очень важен для меня'],
    [2, 'Иногда моё желание чувствовать себя любимым перерастает в острую необходимость быть необходимым'],
    [3, 'В своей жизни больше всего я желаю быть ценным, признанным и желанным'],
    [3, 'Мой образ успешного человека очень важен для меня'],
    [3, 'Иногда моё желание казаться успешным превращается в погоню за статусом'],
    [4, 'В своей жизни больше всего я желаю найти себя и свою значимость, создать личную индивидуальность из собственных переживаний'],
    [4, 'Мои личные чувства очень важны для меня, так как они формируют мою личность'],
    [4, 'Иногда моё желание быть собой превращается в потакание своим желаниям'],
    [5, 'В своей жизни больше всего я желаю быть компетентным'],
    [5, 'Мои внутренние ресурсы очень важны для меня'],
    [5, 'Иногда моё желание быть способным и знающим превращается в накапливание бесполезных знаний'],
    [6, 'В своей жизни больше всего я желаю быть в безопасности, найти поддержку'],
    [6, 'Быть преданным и верным другим людям очень важно для меня'],
    [6, 'Иногда моё желание безопасности превращается в чрезмерную привязанность к моим собственным убеждениям'],
    [7, 'В своей жизни больше всего я желаю быть свободным, удовлетворённым и довольным от того, что все мои потребности удовлетворены'],
    [7, 'Всегда оставаться в движении очень важно для меня'],
    [7, 'Иногда моё желание быть счастливым превращается в маниакальное бегство от жизни'],
    [8, 'В своей жизни больше всего я желаю защитить себя, контролируя свою собственную жизнь и судьбу'],
    [8, 'Быть сильным и непоколебимым очень важно для меня'],
    [8, 'Иногда моё желание контролировать свою жизнь превращается в постоянные конфронтации с окружающими'],
    [9, 'В своей жизни больше всего я желаю сохранить внутреннюю стабильность и душевное спокойствие'],
    [9, 'Гармония в обществе окружающих меня людей очень важна для меня'],
    [9, 'Иногда моё желание быть в мире превращается в упрямую небрежность']]],
  ['Основные страхи и подсознательные детские желания', '', [
    [1, 'В своей жизни больше всего я боюсь быть плохим, коррумпированным, порочным или дефектным'],
    [1, 'Нехорошо делать ошибки'],
    [1, 'В детстве мне приходилось быть очень серьезным и брать на себя взрослую ответственность, играть роль "Героя семьи"'],
    [2, 'В своей жизни больше всего я боюсь быть ненужным, недостойным любви'],
    [2, 'Нехорошо ставить свои нужды выше нужд других людей'],
    [2, 'В детстве я чувствовал, что это моя работа - заботиться о других членах семьи'],
    [3, 'В своей жизни больше всего я боюсь быть никчёмным и не иметь ценности помимо своих достижений'],
    [3, 'Нехорошо иметь собственные чувства и индивидуальность'],
    [3, 'В детстве меня не хвалили за то, какой я есть, и больше внимания уделяли моим достижениям'],
    [4, 'В своей жизни больше всего я боюсь не иметь индивидуальности и личной [для себя] ценности'],
    [4, 'Нехорошо быть слишком эффективным или слишком счастливым'],
    [4, 'В детстве я не находил отражения своих качеств и талантов в родителях. Временами у меня возникали мысли, что они - не мои настоящие родители'],
    [5, 'В своей жизни больше всего я боюсь быть бесполезным, неспособным или некомпетентным'],
    [5, 'Нехорошо чувствовать себя комфортно в этом мире'],
    [5, 'В детстве я чувствовал, что для того, чтобы оставаться в безопасности, мне необходимо отдалиться от семьи в свой собственный мир'],
    [6, 'В своей жизни больше всего я боюсь остаться без поддержки и руководства, быть не в состоянии выжить без поддержки'],
    [6, 'Нехорошо себе доверять'],
    [6, 'В детстве члены семьи не поддерживали моё стремление к независимости, что заставляло меня держаться настороже'],
    [7, 'В своей жизни больше всего я боюсь попасть в капкан боли и лишений'],
    [7, 'Нехорошо зависеть от кого-либо в чем-либо'],
    [7, 'В детстве при возникновении какой-либо проблемы я мгновенно пытался отвлечься на игры'],
    [8, 'В своей жизни больше всего я боюсь, что другие люди причинят мне вред или будут меня контролировать, нарушат мои права'],
    [8, 'Нехорошо быть уязвимым и доверять кому-либо'],
    [8, 'В детстве я часто страдал от чувства отвергнутости и предательства; Из-за своей напористости и рисковости часто делал что-то такое, за что меня наказывали и, чувствуя себя отвергнутым, защищался'],
    [9, 'В своей жизни больше всего я боюсь потери и отделения, "уничтожения"'],
    [9, 'Нехорошо отстаивать свои права'],
    [9, 'В детстве мне приходилось очень часто "исчезать", чтобы не причинять никому беспокойств']
    ]],
  ['Манипулирование людьми', '', [
    [1, 'Поправляя других - настаивая, чтобы другие разделяли мои собственные стандарты'],
    [2, 'Выясняя нужды и желания других - создавая тем самым у них ощущение зависимости'],
    [3, 'Очаровывая других и принимая тот образ, который "сработает"'],
    [4, 'Становясь "человеком настроения" и заставляя других "ходить на цыпочках"'],
    [5, 'Оставаясь поглощённым своими мыслями и эмоционально отстраняясь от других'],
    [6, 'Жалуясь и проверяя других людей на преданность'],
    [7, 'Отвлекая внимание других и настаивая, чтобы выполняли мои требования'],
    [8, 'Доминируя над другими и требуя, чтобы делали, как я говорю'],
    [9, '"Отключаясь" и пассивно-агрессивно сопротивляясь другим']
    ]],
  ['Красные флаги', 'Красный флаг - это дополнительная боязнь, которая появляется у каждого типа в стрессовом состоянии. По сути, ещё один страх, присущий каждому из типов', [
    [1, 'Мои идеалы на самом деле неправильные и контрпродуктивные'],
    [2, 'Я отталкиваю от себя друзей или любимых людей'],
    [3, 'Я проигрываю и все мои претензии пусты и обманчивы'],
    [4, 'Я разрушаю свою жизнь и растрачиваю возможности'],
    [5, 'Мне никогда не найти своего места в этом мире и с этими людьми'],
    [6, 'Своими действиями я причинил вред собственной безопасности'],
    [7, 'Мои действия причиняют мне лишь одни боль и несчастье'],
    [8, 'Все оборачиваются против меня и могут мне отомстить'],
    [9, 'Когда-нибудь действительность заставит меня иметь дело с моими проблемами']
    ]],
  ['Общие вопросы', '', [
    [1, 'Я сфокусирован на необходимости быть правильным, организованным и здравомыслящим; на стандартах, улучшении себя и на знании правил'],
    [1, 'Я управляю своими чувствами путём подавления и отрицания: мои чувства превращаются в деятельность, в желание сделать всё идеально'],
    [1, 'Я хочу работать в рамках системы и раздражаюсь, когда люди нарушают правила'],
    [2, 'Я сфокусирован на позитивном представлении о себе, на своих добрых намерениях. "Я хороший, заботливый человек"'],
    [2, 'Я не хочу видеть свою собственную нуждаемость, разочарование и гнев'],
    [2, 'Я уделяю чрезмерное внимание нуждам других людей; игнорирую собственные нужды'],
    [3, 'Я фокусируюсь на необходимости быть эффективным, способным и выдающимся. Фокусируюсь на целях, на том, что надо быть прагматичным и знать, как себя преподнести'],
    [3, 'Я управляю своими чувствами путём подавления и обращения внимания на стоящие передо мной задачи, на том, чтобы оставаться активным. Достижения нейтрализуют болезненные чувства'],
    [3, 'Я хочу быть и в рамках системы, и вне её - адаптировать правила и находить короткие пути решения проблемы'],
    [4, 'Я ищу кого-то, кто бы меня понял и поддержал мою жизнь и мечты. Мне нужно, чтобы меня увидели'],
    [4, 'Я боюсь, что меня покинут, что никто обо мне не позаботится: что у меня не будет достаточно поддержки для того, чтобы найти себя и стать собой'],
    [4, 'Я общаюсь с другими, стараясь поддерживать к себе интерес и в то же время не раскрывая многого о себе, играя в некую игру, чтобы заинтересовать сторонников'],
    [5, 'Я сфокусирован на необходимости иметь полную информацию обо всём, иметь чёткое представление о вещах и на объективных фактах. Во мне есть потребность быть несколько отстранённым'],
    [5, 'Я управляю своими чувствами путём отделения и абстрагирования от них; я остаюсь занятым и интеллектуальным, как будто эти чувства возникли у кого-то другого'],
    [5, 'Я отрицаю систему и предпочитаю работать самостоятельно, вне этой системы. Я очень нетерпелив к правилам и процедурам'],
    [6, 'Я ищу одинаково как независимость, так и поддержку. Мне нужен человек, на которого можно положиться, но также мне необходимо быть "сильным"'],
    [6, 'Я боюсь остаться покинутым и без поддержки, но также стать слишком зависимым от других'],
    [6, 'Я всегда стараюсь быть преданным и тем, на кого можно положиться, оставаясь при этом независимым; я и вовлекаюсь в отношения, и в то же время отчуждаюсь и дистанцируюсь'],
    [7, 'Я фокусируюсь на позитивном опыте, хороших впечатлениях, деятельности, возбуждении и веселье'],
    [7, 'Я не хочу видеть свою боль и пустоту; свою роль в причинении страданий себе и другим'],
    [7, 'Я уделяю чрезмерное внимание своим собственным нуждам и быстро устаю от нужд других людей'],
    [8, 'Я ищу независимости и возможности полагаться на самого себя. Мне нужно как можно меньше зависеть от других, быть самим себе хозяином'],
    [8, 'Боюсь близости, боюсь стать слишком уязвимым, доверившись кому-то'],
    [8, 'Стараюсь всегда держать оборону, не позволяя другим людям подходить ко мне слишком близко. Делаю себя жёстче, чтобы защититься от своей боли и от того, что мне нужны другие люди'],
    [9, 'Я сфокусирован на положительных качествах других людей и всего, что меня окружает. Возможно, я слишком всё идеализирую'],
    [9, 'Я не хочу видеть проблем с любимыми людьми или со всем тем, что меня окружает'],
    [9, 'Я чувствую себя переполненным своими собственными нуждами и нуждами других людей. Я не хочу иметь дело ни с тем, ни с другим']
    ]],
]

for (i = 0; i < question_sets.length; i += 1) {
  shuffle(question_sets[i][2])
}
create(question_sets)

function recalc() {
  str = ''
  
  str += '[ 1 ] [ 2 ] [ 3 ] [ 4 ] [ 5 ] [ 6 ] [ 7 ] [ 8 ] [ 9 ] Группа\n'
  // get vans
  vans = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
  for (i = 0; i < question_sets.length; i += 1) {
    ans = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    for (j = 0; j < question_sets[i][2].length; j += 1) {
      i_n = 'i' + i + '-' + j
      f_n = '#form' + i + '-' + j
      v_sub = $('input[name=' + i_n + ']:checked', f_n)
      if (v_sub.length == 0) {  // Not selected
        v_sub = 0
      } else {
        v_sub = -v_sub[0].value
      }
      vans[question_sets[i][2][j][0]] -= v_sub  // yeah, the shit..
      ans[question_sets[i][2][j][0]] -= v_sub
    }
    mx = 0
    for (j = 1; j < 10; j += 1) {
      if (ans[j] > mx) {
        mx = ans[j]
      }
    }
    for (j = 1; j < 10; j += 1) {
      str += rjust(ans[j].toString(), 4)
      if (ans[j] == mx) {
        str += '!'
      } else {
        str += ' '
      }
      str += ' '
    }
    str += question_sets[i][0]
    str += '\n'
  }
  str += '[ 1 ] [ 2 ] [ 3 ] [ 4 ] [ 5 ] [ 6 ] [ 7 ] [ 8 ] [ 9 ] Группа\n'
  mx = 0
  for (j = 1; j < 10; j += 1) {
    if (vans[j] > mx) {
      mx = vans[j]
    }
  }
  for (j = 1; j < 10; j += 1) {
    str += rjust(vans[j].toString(), 4)
    if (vans[j] == mx) {
      str += '!'
    } else {
      str += ' '
    }
    str += ' '
  }
  str += 'ИТОГ'
  str += '\n'
  str += '\n'
  
  E1 = vans[1]
  E2 = vans[2]
  E3 = vans[3]
  E4 = vans[4]
  E5 = vans[5]
  E6 = vans[6]
  E7 = vans[7]
  E8 = vans[8]
  E9 = vans[9]
  
  A234 = [E2, E3, E4]
  _T234 = 2 + A234.indexOf(Math.max(...A234))
  A567 = [E5, E6, E7]
  _T567 = 5 + A567.indexOf(Math.max(...A567))
  A891 = [E8, E9, E1]
  _T891 = 8 + A891.indexOf(Math.max(...A891))
  if (_T891 == 10) {
    _T891 = 1
  }
  str += 'Максимум по триадам (без учета крыльев)\n'
  str += 'Сердце ' + _T234 + ' со значением ' + vans[_T234] + '\n'
  str += 'Голова ' + _T567 + ' со значением ' + vans[_T567] + '\n'
  str += 'Тело   ' + _T891 + ' со значением ' + vans[_T891] + '\n'
  str += '\n'
  
  tritype = []
  for (i of [2, 3, 4]) {
    for (j of [5, 6, 7]) {
      for (k of [8, 9, 1]) {
        tritype.push([5*vans[i] + 3*vans[j] + 1*vans[k], i.toString() + '-' + j.toString() + '-' + k.toString()])  //ijk
        tritype.push([5*vans[i] + 3*vans[k] + 1*vans[j], i.toString() + '-' + k.toString() + '-' + j.toString()])  //ikj
        tritype.push([5*vans[j] + 3*vans[i] + 1*vans[k], j.toString() + '-' + i.toString() + '-' + k.toString()])  //jik
        tritype.push([5*vans[j] + 3*vans[k] + 1*vans[i], j.toString() + '-' + k.toString() + '-' + i.toString()])  //jki
        tritype.push([5*vans[k] + 3*vans[i] + 1*vans[j], k.toString() + '-' + i.toString() + '-' + j.toString()])  //kij
        tritype.push([5*vans[k] + 3*vans[j] + 1*vans[i], k.toString() + '-' + j.toString() + '-' + i.toString()])  //kji
      }
    }
  }
  tritype.sort(function(a,b) { if (a[0] - b[0] != 0) return a[0] - b[0]; return a[1] < b[1];})
  str += 'Тритип (без учета крыльев) - чем больше число, тем больше вероятность\n'
  for (k = 0; k < 18; k += 1) {
    for (j = 0; j < 9; j += 1) {
      i = 9 * k + j
      str += tritype[i][1]
      str += ': '
      str += ljust(tritype[i][0].toString(), 3)
      str += '  '
    }
    str += '\n'
  }
  str += '\n'
  
  E1w2 = 3*E1 + E2
  E1w9 = 3*E1 + E9
  E2w1 = 3*E2 + E1
  E2w3 = 3*E2 + E3
  E3w2 = 3*E3 + E2
  E3w4 = 3*E3 + E4
  E4w3 = 3*E4 + E3
  E4w5 = 3*E4 + E5
  E5w4 = 3*E5 + E4
  E5w6 = 3*E5 + E6
  E6w5 = 3*E6 + E5
  E6w7 = 3*E6 + E7
  E7w6 = 3*E7 + E6
  E7w8 = 3*E7 + E8
  E8w7 = 3*E8 + E7
  E8w9 = 3*E8 + E9
  E9w1 = 3*E9 + E1
  E9w8 = 3*E9 + E8
  wings = [
    [E1w2, '1w2'],
    [E1w9, '1w9'],
    [E2w1, '2w1'],
    [E2w3, '2w3'],
    [E3w2, '3w2'],
    [E3w4, '3w4'],
    [E4w3, '4w3'],
    [E4w5, '4w5'],
    [E5w4, '5w4'],
    [E5w6, '5w6'],
    [E6w5, '6w5'],
    [E6w7, '6w7'],
    [E7w6, '7w6'],
    [E7w8, '7w8'],
    [E8w7, '8w7'],
    [E8w9, '8w9'],
    [E9w1, '9w1'],
    [E9w8, '9w8']
  ]
  wings.sort(function(a,b) { if (a[0] - b[0] != 0) return a[0] - b[0]; return a[1] < b[1];})
  str += 'Эннеатип по крыльям - чем больше число, тем больше вероятность\n'
  for (k = 0; k < 2; k += 1) {
    for (j = 0; j < 9; j += 1) {
      i = 9 * k + j
      str += wings[i][1]
      str += ': '
      str += ljust(wings[i][0].toString(), 3)
      str += '  '
    }
    str += '\n'
  }
  str += '\n'
  
  tritypew = []
  for (i of [[E2w1, '2w1'], [E2w3, '2w3'], [E3w2, '3w2'], [E3w4, '3w4'], [E4w3, '4w3'], [E4w5, '4w5']]) {
    for (j of [[E5w4, '5w4'], [E5w6, '5w6'], [E6w5, '6w5'], [E6w7, '6w7'], [E7w6, '7w6'], [E7w8, '7w8']]) {
      for (k of [[E8w7, '8w7'], [E8w9, '8w9'], [E9w1, '9w1'], [E9w8, '9w8'], [E1w2, '1w2'], [E1w9, '1w9']]) {
        tritypew.push([5*vans[i[0]] + 3*vans[j[0]] + 1*vans[k[0]], i[1] + j[1] + k[1]])  //ijk
        tritypew.push([5*vans[i[0]] + 3*vans[k[0]] + 1*vans[j[0]], i[1] + k[1] + j[1]])  //ikj
        tritypew.push([5*vans[j[0]] + 3*vans[i[0]] + 1*vans[k[0]], j[1] + i[1] + k[1]])  //jik
        tritypew.push([5*vans[j[0]] + 3*vans[k[0]] + 1*vans[i[0]], j[1] + k[1] + i[1]])  //jki
        tritypew.push([5*vans[k[0]] + 3*vans[i[0]] + 1*vans[j[0]], k[1] + i[1] + j[1]])  //kij
        tritypew.push([5*vans[k[0]] + 3*vans[j[0]] + 1*vans[i[0]], k[1] + j[1] + i[1]])  //kji
      }
    }
  }
  str += 'Тритип по крыльям (топ-9 вариантов) - чем больше число, тем больше вероятность\n'
  for (i = 1296 - 9; i < 1296; i += 1) {
    str += tritypew[i][1]
    str += ': '
    str += ljust(tritypew[i][0].toString(), 3)
    if (i == 1295) {
      str += ' - наибольшая вероятность'
    }
    str += '\n'
  }
  
  document.getElementById('res').innerHTML = '<pre>' + str + '</pre>'
}

recalc();  // Initial recalc
