test_ver = '[ennea-debug v220826.02]';
default_lang = 'ru';
question_count = '126';
authors_test = link('https://vk.com/itsapartywithmbti', 'тусовка mbti') + ' - yuki0iq, dazzydraw';
authors_tr = [
	['ru', ''],
	['en', 'yuki0iq, ...'],
	['uk', 'dazzydraw, what_if, jade_yujing'],
];
sheet = ''


a1 = ['E1', 2, 1, 0, -1];
a2 = ['E2', 2, 1, 0, -1];
a3 = ['E3', 2, 1, 0, -1];
a4 = ['E4', 2, 1, 0, -1];
a5 = ['E5', 2, 1, 0, -1];
a6 = ['E6', 2, 1, 0, -1];
a7 = ['E7', 2, 1, 0, -1];
a8 = ['E8', 2, 1, 0, -1];
a9 = ['E9', 2, 1, 0, -1];

question_sets = [
	[
		['name', [
			['ru', '??'],
		]],
		['desc', [
			['ru', ''],
		]],
		['cnt_a', 4],
		['cnt_q', 1],
		['questions', [
			[
				['res', [a1]],
				['le', [
					['ru', 'В своей жизни больше всего я стремлюсь к соответствию высоким стандартам, моральным нормам. У меня есть сильное чувство справедливости. Я хочу быть принятым в обществе, быть правильным человеком и заслуживать уважения'],
				]],
			],
			[
				['res', [a1]],
				['le', [
					['ru', 'У меня есть навязчивая идея исправления того, что, по моему мнению, ухудшает мою и чужие жизни'],
				]],
			],
			[
				['res', [a1]],
				['le', [
					['ru', 'У меня есть заранее установленный кодекс ценностей, стандартов, идей, вкусов, правил и т.д.'],
				]],
			],
			[
				['res', [a1]],
				['le', [
					['ru', 'Мысленно готовлю себя к страшному суду, жестокой критике; Я убежден в своей неидеальности и в своем провале, но верю, что могу это изменить'],
				]],
			],
			[
				['res', [a1]],
				['le', [
					['ru', 'Я делю мир на черное и белое и отвергаю все, что не вписывается в рамки идеала'],
				]],
			],
			[
				['res', [a1]],
				['le', [
					['ru', 'Я считаю, что должен подавать пример идеального поведения'],
				]],
			],
			[
				['res', [a1]],
				['le', [
					['ru', 'В детстве мне приходилось быть очень серьезным и брать на себя взрослую ответсвенность, играть роль "Героя семьи"'],
				]],
			],
			[
				['res', [a1]],
				['le', [
					['ru', 'Если и манипулирую другими, то делаю это поправляя их и настаивая, чтобы выполняли разделяли мои собственные стандарты. Часто использую моральные упреки - "ты должен", "ты обязан"'],
				]],
			],
			[
				['res', [a1]],
				['le', [
					['ru', 'Я могу проявить необычайную приверженность, нетерпимость ко всему неряшливому, к любому проявлению неуклюжести'],
				]],
			],
			[
				['res', [a1]],
				['le', [
					['ru', 'Мой гнев проявляется в критичном отношении к окружающим и себе'],
				]],
			],
			[
				['res', [a1]],
				['le', [
					['ru', 'Мой чрезмерный самоконтроль приводит к недостатку непосредственности, неумению импровизировать и также к блокировке эмоционального выражения'],
				]],
			],
			[
				['res', [a1]],
				['le', [
					['ru', 'Могу отказаться от удовольствий в пользу выполнения "долга"'],
				]],
			],
			[
				['res', [a1]],
				['le', [
					['ru', 'В детстве я стремился быть лучше, быть идеальным ребенком в надежде заслужить одобрение одного из родителей и таким образом сблизиться с ним'],
				]],
			],
			[
				['res', [a1]],
				['le', [
					['ru', 'Иногда я чувствую одно, но внешне показываю совсем другое для того, чтобы спрятать от себянепригодные в моем понимании чувства'],
				]],
			],
			[
				['res', [a2]],
				['le', [
					['ru', 'Мой образ любящего и заботливого человека очень важен для меня'],
				]],
			],
			[
				['res', [a2]],
				['le', [
					['ru', 'Иногда мое желание быть любимым перерастает в острую необходимость быть необходимым'],
				]],
			],
			[
				['res', [a2]],
				['le', [
					['ru', 'Ставить нужды других людей выше своих нужд не так уж и хорошо, но тем не менее я готов это сделать, если кому-то нужна помощь'],
				]],
			],
			[
				['res', [a2]],
				['le', [
					['ru', 'Если я и манипулирую людьми, то делаю это, выясняя нужды и желания других и создавая у них тем самым некое ощущение зависимости'],
				]],
			],
			[
				['res', [a2]],
				['le', [
					['ru', 'Я чувствую, что знаю, в чем нуждаются другие люди и даю им это, но в случае отказа могу стать чересчур напористым'],
				]],
			],
			[
				['res', [a2]],
				['le', [
					['ru', 'Иногда я вытесняю неприятные мне чувства и импульсы. Например, я могу забыть какой-то неприятный жизненный опыт или забыть сделать что-то неприятное. Иногда я вытесняю даже свои потребности'],
				]],
			],
			[
				['res', [a2]],
				['le', [
					['ru', 'Я могу с головой погружаться во взаимоотношения и воспринимать партнера как свою собственность (возможно, я проявляю это в стрессе)'],
				]],
			],
			[
				['res', [a2]],
				['le', [
					['ru', 'Я не хочу нуждаться в ком-либо. Я хочу быть тем, в ком нуждаются'],
				]],
			],
			[
				['res', [a2]],
				['le', [
					['ru', 'Одобрение меня и моих действий окружающими людьми очень важно для меня, но я не хочу быть зависимым от этого'],
				]],
			],
			[
				['res', [a2]],
				['le', [
					['ru', 'Я делаю добрые дела для других людей в надежде, что другие позаботятся обо мне в ответ (возможно, проявляю это в стрессе)'],
				]],
			],
			[
				['res', [a2]],
				['le', [
					['ru', 'Я ищу свою значимость через получение особого внимания от других, через любовь окружающих ко мне. Когда я забочусь о других, я чувствую себя значимым'],
				]],
			],
			[
				['res', [a2]],
				['le', [
					['ru', 'Я "считываю" окружающих людей, настраиваюсь на их настроения и предпочтения, чтобы усилить эмоциональную связь'],
				]],
			],
			[
				['res', [a2]],
				['le', [
					['ru', 'Я, в основном, выражаю только счастливые чувства и оптимизм, чтобы казаться другим более приятным человеком'],
				]],
			],
			[
				['res', [a2]],
				['le', [
					['ru', 'В детстве заботиться о других членах моего окружения (родителях, друзьях, братьях и сестрах) было моей работой. Я был уверен, что получу любовь, если принесу себя в жертву другим'],
				]],
			],
			[
				['res', [a3]],
				['le', [
					['ru', 'В своей жизни больше всего я боюсь, что меня не будут любить без моих достижений, денег, красоты и т.д.'],
				]],
			],
			[
				['res', [a3]],
				['le', [
					['ru', 'В детстве меня не хвалили за то, кем я являюсь, и больше внимания уделяли моим достижениям'],
				]],
			],
			[
				['res', [a3]],
				['le', [
					['ru', 'Я - это та роль, которую я играю в жизни, поэтому я должен быть успешным и реализовывать свои цели'],
				]],
			],
			[
				['res', [a3]],
				['le', [
					['ru', 'В попытках идентифицировать себя со своей "ролью" и в безудержных гонках за тем, чтобы достичь того, что кажется наиболее ценным, я теряюсь настолько сильно, что постепенно начинаю отказываться от своих собственных чувств, перестаю понимать их'],
				]],
			],
			[
				['res', [a3]],
				['le', [
					['ru', 'Я не создаю образы, принижающие самого себя. Для меня это бессмысленно, ведь я пытаюсь создать образ, который можно будет "продать"'],
				]],
			],
			[
				['res', [a3]],
				['le', [
					['ru', 'У меня есть мастерское умение преподносить события, идеи и свои истории (даже если они неправдивые)'],
				]],
			],
			[
				['res', [a3]],
				['le', [
					['ru', 'С любой ролью я справлюсь легче, чем со своим собственным "я", с которым я едва знаком'],
				]],
			],
			[
				['res', [a3]],
				['le', [
					['ru', 'Я неосознанно избегаю выражения своих эмоций, чтобы показывать себя только с хорошей стороны и чтобы сохранить свои время и силы на более важную деятельность'],
				]],
			],
			[
				['res', [a3]],
				['le', [
					['ru', 'Я избегаю неудачи любой ценой, а если думаю, что могу где-то ошибиться, то могу даже не начинать (возможно, проявляю это в стрессе)'],
				]],
			],
			[
				['res', [a3]],
				['le', [
					['ru', 'Все зависит лишь от меня, поэтому я должен быть эффективным и все контролировать'],
				]],
			],
			[
				['res', [a3]],
				['le', [
					['ru', 'Отношения это хорошо, но эффективная работа стоит на первом плане'],
				]],
			],
			[
				['res', [a3]],
				['le', [
					['ru', 'Я есть то, что я делаю. Моя деятельность определяет меня'],
				]],
			],
			[
				['res', [a3]],
				['le', [
					['ru', 'Вся моя жизнь похожа на бесконечную негласную конкуренцию. Я часто сравниваю себя с другими: кто лучше, кто красивее, у кого самые лучшие дети и т.д. Главное, чтобы сравнение было в мою пользу'],
				]],
			],
			[
				['res', [a3]],
				['le', [
					['ru', 'В попытках удовлетворить ожидания окружающих я могу забыть, чего хочу сам'],
				]],
			],
			[
				['res', [a4]],
				['le', [
					['ru', 'В своей жизни больше всего я желаю найти себя и свою значимость, создать индивидуальную личность из собственных переживаний, интересов, чувств и т.д.'],
				]],
			],
			[
				['res', [a4]],
				['le', [
					['ru', 'Иногда мое желание быть собой, прожить свою жизнь без сожалений превращается в потакание своим прихотям'],
				]],
			],
			[
				['res', [a4]],
				['le', [
					['ru', 'В своей жизни больше всего я боюсь не иметь индивидуальности и личной (для себя) ценности'],
				]],
			],
			[
				['res', [a4]],
				['le', [
					['ru', 'В детстве я не находил отражения своих качеств и талантов в родителях. Временами у меня возникали мысли, что они - не мои настоящие родители'],
				]],
			],
			[
				['res', [a4]],
				['le', [
					['ru', 'Больше всего я боюсь, что я разрушаю свою жизнь и растрачиваю возможности'],
				]],
			],
			[
				['res', [a4]],
				['le', [
					['ru', 'Я часто слишком много рассуждаю, пытаясь понять, почему я не могу являться частью группы и общества'],
				]],
			],
			[
				['res', [a4]],
				['le', [
					['ru', 'Я не могу просить у людей что-либо напрямую. Я хочу, чтобы окружающие сами заметили мои проблемы, поэтому иногда могу часто жаловаться или наоборот скрывать свою боль (при этом постоянно думая, когда же это заметят...)'],
				]],
			],
			[
				['res', [a4]],
				['le', [
					['ru', 'Мне кажется, что другие лучше и значимее меня, поэтому я сам не заслуживаю счастья или любви'],
				]],
			],
			[
				['res', [a4]],
				['le', [
					['ru', 'Когда всем вокруг радостно, я обычно испытываю прямо противоположные чувства и поэтому чувствую себя отдельным от группы, отличающимся (не обязательно "наслаждаюсь" тем, что отличаюсь в данном случае)'],
				]],
			],
			[
				['res', [a4]],
				['le', [
					['ru', 'Я часто спрашиваю других "что вы обо мне думаете?", "на что/кого я похож?", "как вы меня видите?". Мне интересно знать, как люди видят меня со стороны, с чем я у них ассоциируюсь'],
				]],
			],
			[
				['res', [a4]],
				['le', [
					['ru', 'Нравится мне испытывать негативные чувства или нет - я в любом случае склонен романтизировать их'],
				]],
			],
			[
				['res', [a4]],
				['le', [
					['ru', 'В какой-то момент в моем детстве я почувствовал, что моя семья предпочла бы выбрать кого-то другого, а не меня. Я почувстовал разделение с ними и нуждался во внимании'],
				]],
			],
			[
				['res', [a4]],
				['le', [
					['ru', 'Иногда я "впитываю" в себя взгляды, мнения, мотивы и установки от других людей и могу делать это неосознанно'],
				]],
			],
			[
				['res', [a4]],
				['le', [
					['ru', 'Мне необязательно нужно абсолютное внимание к своей персоне или сочувствие, но я бы хотел, чтобы окружающие знали о моих проблемах и как-то реагировали на них. Тем не менее, мне не всегда приятно, когда обо мне знают слишком много'],
				]],
			],
			[
				['res', [a5]],
				['le', [
					['ru', 'Иногда мое желание быть способным и знающим превращается в накопление бесполезных знаний'],
				]],
			],
			[
				['res', [a5]],
				['le', [
					['ru', 'В своей жизни больше всего я хочу быть полезным, способным, компетентным и знающим'],
				]],
			],
			[
				['res', [a5]],
				['le', [
					['ru', 'В детстве я чувствовал, что для того, чтобы оставаться в безопасности и комфортной обстановке, мне необходимо отдалиться от семьи в свой собственный мир'],
				]],
			],
			[
				['res', [a5]],
				['le', [
					['ru', 'Если я и манипулирую людьми, то делаю это, оставаясь поглощенным своими мыслями и эмоционально отстраняясь от других'],
				]],
			],
			[
				['res', [a5]],
				['le', [
					['ru', 'Я не могу начать действовать, пока у меня не будет достаточно ресурсов и знаний для этого. Подготовка к "действию" у меня может занимать много времени'],
				]],
			],
			[
				['res', [a5]],
				['le', [
					['ru', 'Я минимизирую свои потребности, чтобы другие не требовали от меня слишком многого'],
				]],
			],
			[
				['res', [a5]],
				['le', [
					['ru', 'Я не готов тратить слишком много времени, энергии, денег и ресурсов на других людей и также не ожидаю, что кто-то будет тратить их на меня. Я полагаюсь только на свои собственные возможности и знания'],
				]],
			],
			[
				['res', [a5]],
				['le', [
					['ru', 'Я чувствителен к постороннему вмешательству в мой мир и крайне не люблю, когда кто-то мне мешает, что-то от меня требует'],
				]],
			],
			[
				['res', [a5]],
				['le', [
					['ru', 'Я склонен лишь наблюдать за социальными взаимодействиями других людей дабы понять их до конца'],
				]],
			],
			[
				['res', [a5]],
				['le', [
					['ru', 'Меня тревожит ощущение собственной слабости, бесполезности, уязвимости и ранимости при столкновении с людьми и реальным миром. В жизни мне проще быть наблюдателем, чем участником'],
				]],
			],
			[
				['res', [a5]],
				['le', [
					['ru', 'Я склонен отделять свои чувства от произошедших со мною событий. Нечто травмирующее для себя я могу вспоминать и рассказывать абсолютно спокойно. Мои чувства будто стерлись из воспоминаний'],
				]],
			],
			[
				['res', [a5]],
				['le', [
					['ru', 'В детстве я чувствовал отчуждение от своих сверстников или братьев/сестер'],
				]],
			],
			[
				['res', [a5]],
				['le', [
					['ru', 'Если меня не видят, то на меня не нападут, поэтому я склонен к изоляции'],
				]],
			],
			[
				['res', [a5]],
				['le', [
					['ru', 'Когда кто-то что-то делает для меня я чувствую вину, так как не смогу отдать ничего взамен'],
				]],
			],
			[
				['res', [a6]],
				['le', [
					['ru', 'В своей жизни больше всего я боюсь остаться без поддержки и руководства, быть не в состоянии выжить без поддержки'],
				]],
			],
			[
				['res', [a6]],
				['le', [
					['ru', 'Для спокойного существования мне нужна сильная личность (этой личностью могу быть даже я сам) или некая материальная опора (деньги и т.д.), которая давала бы мне ощущение безопасности'],
				]],
			],
			[
				['res', [a6]],
				['le', [
					['ru', 'Я всегда ожидаю худшего, поэтому если случается что-то хорошее, я приятно удивляюсь (либо ищу подвох...)'],
				]],
			],
			[
				['res', [a6]],
				['le', [
					['ru', 'В детстве я никогда не ощущал определенности, не понимал, на что могу положиться. В любой момент меня могли за что-то наказать, поэтому я старался предугадывать все ситуации, которые могли произойти. Продумывал, что может случиться, если я что-то скажу или что-то сделаю'],
				]],
			],
			[
				['res', [a6]],
				['le', [
					['ru', 'Я часто неосознанно ищу скрытые смыслы, намерения и подозрительное в поведении окружающих'],
				]],
			],
			[
				['res', [a6]],
				['le', [
					['ru', 'Я боюсь совершать ошибки, поэтому нуждаюсь в четких указаниях насчет того, что надо делать и что является хорошим, а что - плохим'],
				]],
			],
			[
				['res', [a6]],
				['le', [
					['ru', 'Чтобы защитить себя и смягчить болезненное чувство вины я могу начать обвинять окружающих в своих проблемах'],
				]],
			],
			[
				['res', [a6]],
				['le', [
					['ru', 'Я сомневаюсь в самом себе и в собственных сомнениях'],
				]],
			],
			[
				['res', [a6]],
				['le', [
					['ru', 'Я пытаюсь предугадать все возможные опасности и потенциальные проблемы, чтобы избежать их или чтобы быть готовым бороться с ними'],
				]],
			],
			[
				['res', [a6]],
				['le', [
					['ru', 'Меня притягивает авторитетное мнение, но я одновременно не доверяю ему. Для начала мне нужно убедиться в том, что этот авторитет благосклонен и "знает, о чем говорит". Но как только я почувствую, что это мнение хорошее, то отождествляю себя с ним'],
				]],
			],
			[
				['res', [a6]],
				['le', [
					['ru', 'Даже если я и пытался отказаться от авторитетов и их поддержки, в конце-концов я все равно осознавал, что нуждаюсь в этом'],
				]],
			],
			[
				['res', [a6]],
				['le', [
					['ru', 'Моя тревожность буквально является важной составляющей моей личности, это огромная часть меня. Я тревожусь практически обо всем'],
				]],
			],
			[
				['res', [a6]],
				['le', [
					['ru', 'Я хочу держать дистанцию с другими людьми, при этом чувствуя, что другие находятся рядом, чтобы помочь мне'],
				]],
			],
			[
				['res', [a6]],
				['le', [
					['ru', 'Я боюсь перемен и больше склонен к рутине'],
				]],
			],
			[
				['res', [a7]],
				['le', [
					['ru', 'В своей жизни больше всего я желаю быть свободным, удовлетворенным и довольным от того, что все мои потребности удовлетворены'],
				]],
			],
			[
				['res', [a7]],
				['le', [
					['ru', 'Мое стремление быть счастливым превращается в маниакальное бегство от жизни, в мечтания об идеальном будущем'],
				]],
			],
			[
				['res', [a7]],
				['le', [
					['ru', 'Я избегаю боли, ведь зачем грустить, если можно быть веселым и наслаждаться жизнью?'],
				]],
			],
			[
				['res', [a7]],
				['le', [
					['ru', 'Я испытываю трудности с эмоциональными проблемами и чувствую себя некомфортно, когда кто-то из моего окружения несчастен. Вокруг меня должна быть благоприятная атмосфера'],
				]],
			],
			[
				['res', [a7]],
				['le', [
					['ru', 'Если немного чего-то приятно, то неограниченное количество должно принести неслыханные удовольствия'],
				]],
			],
			[
				['res', [a7]],
				['le', [
					['ru', 'Если текущее настоящее разочаровывает меня, то я стремлюсь ко всему тому удивительному и необыкновенному, что может произойти в будущем'],
				]],
			],
			[
				['res', [a7]],
				['le', [
					['ru', 'Я снисходителен как к собственным, так и к чужим слабостям: не люблю ограничивать себя в удовольствии и не ограничиваю других (только если их удовольствия не препятствуют моим удовольствиям)'],
				]],
			],
			[
				['res', [a7]],
				['le', [
					['ru', 'Я не стремлюсь принадлежать к власти и вообще не могу воспринимать власть всерьез. В отношениях я чаще всего поддерживаю равные отношения с людьми. Если я и желаю власти, то лучше буду играть роль "серого кардинала"'],
				]],
			],
			[
				['res', [a7]],
				['le', [
					['ru', 'Я не люблю отказывать себе в удовольствиях и связывать себя обязательствами'],
				]],
			],
			[
				['res', [a7]],
				['le', [
					['ru', 'Я могу переделывать объяснения своих действий и мотивов так, что совершаемые мной поступки начинают казаться добрыми, хорошими и возможно даже благородными. Могу объяснить ситуацию под другим углом, чтобы избавиться от ненужных обязательств'],
				]],
			],
			[
				['res', [a7]],
				['le', [
					['ru', 'Я всегда создаю планы о том, что нужно делать и что должно произойти; в итоге все равно всегда разочарован результатом и хочу большего'],
				]],
			],
			[
				['res', [a7]],
				['le', [
					['ru', 'Я часто играю роль "активизатора": вливаю энергию и возбуждение в любую ситуацию для того, чтобы все активизировалось, придаю настроение группе. Мне не сложно играть эту роль, но со временем я начинаю уставать'],
				]],
			],
			[
				['res', [a7]],
				['le', [
					['ru', 'В детстве я ощущал, что мой родитель не мог бы мне помогать и оказывать поддержку на постоянном уровне по какой-либо причине, поэтому я поддерживал себя сам с помощью отвлекающих факторов, занятий и объектов, которые пробуждали мое воображение и захватывали меня'],
				]],
			],
			[
				['res', [a7]],
				['le', [
					['ru', 'Мне доставляет большое удовольствие стратегически обдумывать много новых идей и лишь иногда вовлекаться в их детальную проработку и реализацию'],
				]],
			],
			[
				['res', [a8]],
				['le', [
					['ru', 'В своей жизни больше всего я хочу защитить себя путем контролирования своей жизни и путем борьбы с несправедливостью'],
				]],
			],
			[
				['res', [a8]],
				['le', [
					['ru', 'Иногда мое желание контролировать свою жизнь превращается в постоянные конфронтации с окружающими'],
				]],
			],
			[
				['res', [a8]],
				['le', [
					['ru', 'Я расцениваю себя как человека, бросающего "вызов", как кого-то, кто выталкивает людей из зоны комфорта для того, чтобы они добились наилучшего результата (не значит, что я делаю это постоянно)'],
				]],
			],
			[
				['res', [a8]],
				['le', [
					['ru', 'Хоть я и необязательно "люблю" конфликты, я могу конфликтовать с окружающими если мне нужно двигаться дальше, получить то, что я хочу, защитить кого-то или противостоять несправедливости'],
				]],
			],
			[
				['res', [a8]],
				['le', [
					['ru', 'У меня есть право делать то, что я хочу, и управлять собой в соответствии со своими собственными ценностями, не обязательно соответствующими тому, что установлено'],
				]],
			],
			[
				['res', [a8]],
				['le', [
					['ru', 'Я сильный и могу поставить себя выше боли, отрицая слабость. Никто не должен решать мои проблемы за меня'],
				]],
			],
			[
				['res', [a8]],
				['le', [
					['ru', 'Пытаясь добиться справедливости я могу переборщить и стать агрессивным, начать разрушать себя и других'],
				]],
			],
			[
				['res', [a8]],
				['le', [
					['ru', 'Я могу сурово наказать того, кто меня обидел, но еще более жестоким я буду по отношению к себе, если почувствую, что действовал несправедливо'],
				]],
			],
			[
				['res', [a8]],
				['le', [
					['ru', 'Я стремлюсь противостоять авторитетам и испытываю презрение по отношению к традиционным ценностям. Мои взгляды революционны'],
				]],
			],
			[
				['res', [a8]],
				['le', [
					['ru', 'Быть слабым, сговорчивым и приятным для окружающих не оправдывает себя, поэтому лучше я буду конкурировать, демонстрировать свое превосходство и властность. В мире, ограничивающем свободу личности, только сила и способность отстаивать свои желания в борьбе может позволить индивиду выражать свои желания'],
				]],
			],
			[
				['res', [a8]],
				['le', [
					['ru', 'В детстве мои родители или окружающий меня мир были несправедливыми и чрезмерно контролирующими. Меня заставляли молчать о моих потребностях и желаниях, заставляли вести себя должным образом, поэтому я стал сильнее и сейчас не позволю никому меня контролировать'],
				]],
			],
			[
				['res', [a8]],
				['le', [
					['ru', 'Я не испытываю особой симпатии к тем, кто слаб и нерешителен - слабость притягивает проблемы. Тем не менее, я всегда готов защищать тех, кто мне дорог'],
				]],
			],
			[
				['res', [a8]],
				['le', [
					['ru', 'Я чувствую себя наиболее в тонусе, когда делаю вещи, которве другие считают невозможными. Мне нравится "ходить по краю" и смотреть, удастся ли мне добиться успеха, несмотря ни на что'],
				]],
			],
			[
				['res', [a8]],
				['le', [
					['ru', 'Мне кажется, что люди, которые меня знают, больше всего ценят во мне то, что я чаще всего говорю прямо то, что думаю. Мне не нравится "ходить вокруг да около"'],
				]],
			],
			[
				['res', [a9]],
				['le', [
					['ru', 'В своей жизни больше всего я желаю сохранить внутреннюю стабильность, душевное спокойствие и комфорт'],
				]],
			],
			[
				['res', [a9]],
				['le', [
					['ru', 'Мне кажется, что если я буду отстаивать свои нужды и интересы, то люди разочаруются во мне и, может быть, начнут конфликт. Легче будет просто принять мнение других'],
				]],
			],
			[
				['res', [a9]],
				['le', [
					['ru', 'В детстве мне часто приходилось выступать "утешителем" для членов своей семьи; Иногда приходилось просто "исчезать", чтобы не причинять никому беспокойств'],
				]],
			],
			[
				['res', [a9]],
				['le', [
					['ru', 'Я выражаю свое недовольство, не подвергая себя бурным эмоциям: отсиживаюсь или исчезаю'],
				]],
			],
			[
				['res', [a9]],
				['le', [
					['ru', 'Больше всего в жизни я боюсь, что действительность заставит меня столкнуться с моими проблемами'],
				]],
			],
			[
				['res', [a9]],
				['le', [
					['ru', 'Для того, чтобы не чувствовать дискомфорт, я буду использовать любой доступный способ, вроде еды, алкоголя, развлечений, обычных домашних дел и т.д.'],
				]],
			],
			[
				['res', [a9]],
				['le', [
					['ru', 'Иногда я веду себя упрямо и отказываюсь что-то менять в себе и своей жизни, потому что это может нарушить мое внутреннее душевное спокойствие'],
				]],
			],
			[
				['res', [a9]],
				['le', [
					['ru', 'Я не желаю видеть, быть в контакте со своими переживаниями и потребностями. Я не знаю, чего я хочу, и в общем-то это не так уж и важно'],
				]],
			],
			[
				['res', [a9]],
				['le', [
					['ru', 'Проще принимать вещи такими, какие они есть. Вряд ли мы сможем многое изменить, так зачем сильно переживать из-за этого?'],
				]],
			],
			[
				['res', [a9]],
				['le', [
					['ru', 'Я бываю чрезмерно податлив к требованиям и нуждам окружающих и могу даже отложить собственные потребности и желания в сторону'],
				]],
			],
			[
				['res', [a9]],
				['le', [
					['ru', 'Мне не нужно всеобщее одобрение, просто дайте мне быть частью жизни окружающих (семьи, нации, команды и т.д.)'],
				]],
			],
			[
				['res', [a9]],
				['le', [
					['ru', 'У меня есть некое "внутреннее убежище", место, где я могу быть свободным от требований других людей, где я остаюсь спокоен и где нет ни моих, ни чужих проблем'],
				]],
			],
			[
				['res', [a9]],
				['le', [
					['ru', 'Несмотря на то, что я стремлюсь приспосабливаться к другим, я очень упрям, сопротивляюсь другим и не хочу, чтобы какая-либо угроза моему спокойствию влияла на меня. У меня есть невероятное стремление к тому, чтобы меня оставили в покое'],
				]],
			],
			[
				['res', [a9]],
				['le', [
					['ru', 'Я боюсь, что если я позволю своему гневу выйти наружу, то потеряю связь и доверие близких мне людей и свое душевное спокойствие'],
				]],
			],
		]],
	],
];
shuffle_questions();


function upd() {
	recalc();
}

function recalc() {
	let str = '';

	let lang = get_lang();

	cnt = 0;
	E1 = 0, E2 = 0, E3 = 0, E4 = 0, E5 = 0, E6 = 0, E7 = 0, E8 = 0, E9 = 0;
	pull_results2();

	eval(tr_helper);
	let txt = [
		['raw', [
			['ru', 'Исходный результат'],
			['en', 'Raw test score'],
			['uk', 'Вихідний результат'],
		]],
		['type', [
			['ru', 'Тип'],
			['en', 'Type'],
			['uk', 'Тип'],
		]],
		['type3', [
			['ru', 'Тритип'],
			['en', 'Tritype'],
		]],
		['core', [
			['ru', 'Ядро'],
			['en', 'Core'],
		]],
		['score', [
			['ru', 'Счёт'],
			['en', 'Score'],
			['uk', 'Підсумок'],
		]],
		['probable', [
			['ru', 'Самый вероятный тип имеет наибольший счёт.'],
			['en', 'Best fit type has maximal score.'],
			['uk', 'Найбільш імовірний тип має найбільший підсумок.'],
		]],
		['ans', [
			['ru', 'Наиболее вероятный тип:'],
			['en', 'Best fit type is'],
			['uk', 'Найбільш імовірний тип:'],
		]],
		['range', [
			['ru', 'Возможный разброс баллов от -14 до 28.'],
			['en', 'Maximal score range is from -14 to 28.'],
			['uk', 'Можливий розрахунок балів від -14 до 28.'],
		]],
		['range3', [
			['ru', 'Возможный разброс баллов от -42 до 84.'],
			['en', 'Maximal score range is from -42 to 84.'],
			['uk', 'Можливий розрахунок балів від -42 до 84.'],
		]],
		['besthint', [
			['ru', 'Результат достовернее, если общий разброс больше, максимум больше, отрыв максимума от соседних типов сильнее'],
			['en', 'Better result has wider score range, greater maximum and greateness of maximal score over its neighbors'],
			['uk', 'Результат вірогідніший, якщо максимальна різниця більша, відрив максимального результату від сусідніх типів сильніший'],
		]],
		['2', [
			['ru', 'Помощник'],
		]],
		['3', [
			['ru', 'Достигатель'],
		]],
		['4', [
			['ru', 'Индивидуалист'],
		]],
		['5', [
			['ru', 'Наблюдатель'],
		]],
		['6', [
			['ru', 'Скептик'],
		]],
		['7', [
			['ru', 'Весельчак'],
		]],
		['8', [
			['ru', 'Конфронтатор'],
		]],
		['9', [
			['ru', 'Посредник'],
		]],
		['1', [
			['ru', 'Перфекционист'],
		]],
		['125', [
			['ru', 'Наставник'],
			['en', 'The Mentor'],
		]],
		['126', [
			['ru', 'Поддерживатель'],
			['en', 'The Supporter'],
		]],
		['127', [
			['ru', 'Учитель'],
			['en', 'The Teacher'],
		]],
		['135', [
			['ru', 'Технический эксперт'],
			['en', 'The Technical Expert'],
		]],
		['136', [
			['ru', 'Надсмотрщик'],
			['en', 'The Taskmaster'],
		]],
		['137', [
			['ru', 'Системостроитель'],
			['en', 'The Systems Builder'],
		]],
		['145', [
			['ru', 'Исследователь'],
			['en', 'The Researcher'],
		]],
		['146', [
			['ru', 'Философ'],
			['en', 'The Philosopher'],
		]],
		['147', [
			['ru', 'Визионер'],
			['en', 'The Visionary'],
		]],
		['258', [
			['ru', 'Стратег'],
			['en', 'The Strategist'],
		]],
		['259', [
			['ru', 'Решатель'],
			['en', 'The Problem Solver'],
		]],
		['268', [
			['ru', 'Спасатель'],
			['en', 'The Rescuer'],
		]],
		['269', [
			['ru', 'Добрый самарянин'],
			['en', 'The Good Samaritan'],
		]],
		['278', [
			['ru', 'Свободный дух'],
			['en', 'The Free Spirit'],
		]],
		['279', [
			['ru', 'Миротворец'],
			['en', 'The Peacemaker'],
		]],
		['358', [
			['ru', 'Мастер решений'],
			['en', 'The Solution Master'],
		]],
		['359', [
			['ru', 'Мыслитель'],
			['en', 'The Thinker'],
		]],
		['368', [
			['ru', 'Борец за справедливость'],
			['en', 'The Justice Fighter'],
		]],
		['369', [
			['ru', 'Посредник'],
			['en', 'The Mediator'],
		]],
		['378', [
			['ru', 'Подстрекатель'],
			['en', 'The Mover Shaker'],
		]],
		['379', [
			['ru', 'Посол'],
			['en', 'The Ambassador'],
		]],
		['458', [
			['ru', 'Ученик'],
			['en', 'The Scholar'],
		]],
		['459', [
			['ru', 'Созерцатель'],
			['en', 'The Contemplative'],
		]],
		['468', [
			['ru', 'Говорящий правду'],
			['en', 'The Truth Teller'],
		]],
		['469', [
			['ru', 'Искатель'],
			['en', 'The Seeker'],
		]],
		['478', [
			['ru', 'Посланник'],
			['en', 'The Messenger'],
		]],
		['479', [
			['ru', 'Мягкий дух'],
			['en', 'The Gentle Spirit'],
		]],
	];

	str += h3(TR('raw'));
	str += table([
		tr([th(TR('type')),  th('2'), th('3'), th('4'), td(''), th('5'), th('6'), th('7'), td(''), th('8'), th('9'), th('1')]),
		tr([th(TR('score')), td(E2 ), td(E3 ), td(E4 ), td(''), td(E5 ), td(E6 ), td(E7 ), td(''), td(E8 ), td(E9 ), td(E1 )]),
	]);
	str += p(TR('range'));

	let type = [[E2, '2'], [E3, '3'], [E4, '4'], [E5, '5'], [E6, '6'], [E7, '7'], [E8, '8'], [E9, '9'], [E1, '1']];
	for (let i = 0; i < 9; i += 1) type[i][1] = type[i][1] + ' (' + TR(type[i][1]) + ')';

	let type3 = [];
	for (let i of [[E2, '2'], [E3, '3'], [E4, '4']]) {
		for (let j of [[E5, '5'], [E6, '6'], [E7, '7']]) {
			for (let k of [[E8, '8'], [E9, '9'], [E1, '1']]) {
				let val  = i[0] + j[0] + k[0];
				let name = [i[1], j[1], k[1]];
				name.sort();
				name = name.join('');
				let mxv  = Math.max(i[0], j[0], k[0]);
				let core = '';
				if (i[0] == mxv) core += i[1];
				if (j[0] == mxv) core += j[1];
				if (k[0] == mxv) core += k[1];
				type3.push([val, name, core]);
			}
		}
	}
	type.sort(paircmp);
	type3.sort(paircmp);

	let col_names1 = [th(TR('type'))], col_cores1 = [th(TR('core'))], col_vals1 = [th(TR('score'))];
	let col_names2 = [th(TR('type'))], col_cores2 = [th(TR('core'))], col_vals2 = [th(TR('score'))];
	let col_names3 = [th(TR('type'))], col_cores3 = [th(TR('core'))], col_vals3 = [th(TR('score'))];
	let col_names4 = [th(TR('type'))], col_cores4 = [th(TR('core'))], col_vals4 = [th(TR('score'))];
	let col_empty = [td('')];
	for (let i = 0; i < 7; i += 1) col_empty.push(td(''));
	for (let i = 0; i < 7; i += 1) {
		col_names1.push(td(bold([...type3[i][1]].join('-'))));
		col_cores1.push(td(type3[i][2]));
		col_vals1 .push(td(type3[i][0]));
	}
	for (let i = 7; i < 14; i += 1) {
		col_names2.push(td(bold([...type3[i][1]].join('-'))));
		col_cores2.push(td(type3[i][2]));
		col_vals2 .push(td(type3[i][0]));
	}
	for (let i = 14; i < 21; i += 1) {
		col_names3.push(td(bold([...type3[i][1]].join('-'))));
		col_cores3.push(td(type3[i][2]));
		col_vals3 .push(td(type3[i][0]));
	}
	for (let i = 21; i < 27; i += 1) {
		col_names4.push(td(bold([...type3[i][1]].join('-'))));
		col_cores4.push(td(type3[i][2]));
		col_vals4 .push(td(type3[i][0]));
	}
	col_names4.push(td('')); col_cores4.push(td('')); col_vals4.push(td(''));

	str += h3(TR('type'))
	str += p(TR('probable') + ' ' + test_ver);
	str += table([
		tr([th(TR('type')), th(TR('score'))]),
		tr([td(type[0][1]), td(type[0][0])]),
		tr([td(type[1][1]), td(type[1][0])]),
		tr([td(type[2][1]), td(type[2][0])]),
		tr([td(type[3][1]), td(type[3][0])]),
		tr([td(type[4][1]), td(type[4][0])]),
		tr([td(type[5][1]), td(type[5][0])]),
		tr([td(type[6][1]), td(type[6][0])]),
		tr([td(type[7][1]), td(type[7][0])]),
		tr([td(type[8][1]), td(type[8][0])]),
	]);
	str += p(TR('ans') + ' ' + bold(type[8][1]));
	str += p(TR('range') + ' ' + TR('besthint'));


	str += h3(TR('type3'));
	str += p(TR('probable') + ' ' + test_ver);
	str += table([
		tr(col_names1), tr(col_cores1), tr(col_vals1), tr(col_empty),
		tr(col_names2), tr(col_cores2), tr(col_vals2), tr(col_empty),
		tr(col_names3), tr(col_cores3), tr(col_vals3), tr(col_empty),
		tr(col_names4), tr(col_cores4), tr(col_vals4),
	]);
	str += p(TR('ans') + ' ' + bold([...type3[26][1]].join('-') + ' core ' + type3[26][2]) + ' (' + TR(type3[26][1]) + ')');
	str += p(TR('range3') + ' ' + TR('besthint'));

	document.getElementById('res').innerHTML = str;
}

function chlang() {
	let lang = get_lang();
	create2(question_sets, lang, test_ver, authors_test, authors_tr, question_count, sheet);
	recalc();  // Initial recalc
}

chlang();  // Initial set lang + recalc

