test_ver = '[mbti-debug v220817.00]';
default_lang = 'ru';
question_count = '205';
authors_test = link('https://vk.com/itsapartywithmbti', 'тусовка mbti') + ' - yuki0iq, dazzydraw, narrateee, GunterXR';
authors_tr = [
	['ru', ''],
	['en', 'yuki0iq, ...'],
	['uk', 'dazzydraw, what_if, jade_yujing'],
];
sheet = ''


// Cognitive functions
aNi = ['Ni', 2, 1, 0, 0, -1], aNe = ['Ne', 2, 1, 0, 0, -1], aSi = ['Si', 2, 1, 0, 0, -1], aSe = ['Se', 2, 1, 0, 0, -1]
aFi = ['Fi', 2, 1, 0, 0, -1], aFe = ['Fe', 2, 1, 0, 0, -1], aTi = ['Ti', 2, 1, 0, 0, -1], aTe = ['Te', 2, 1, 0, 0, -1];
// Axes
aNiSe = ['NiSe', 2, 1, 0, 0, -1], aNeSi = ['NeSi', 2, 1, 0, 0, -1], aFiTe = ['FiTe', 2, 1, 0, 0, -1], aFeTi = ['FeTi', 2, 1, 0, 0, -1];
// Vertigo
aNiV = ['NiV', 2, 1, 0, -1], aNeV = ['NeV', 2, 1, 0, -1], aSiV = ['SiV', 2, 1, 0, -1], aSeV = ['SeV', 2, 1, 0, -1];
// loops
alNiFe = ['lNiFe', 2, 1, 0, -1], alNiTe = ['lNiTe', 2, 1, 0, -1], alNeFi = ['lNeFi', 2, 1, 0, -1], alNeTi = ['lNeTi', 2, 1, 0, -1];
alSiFe = ['lSiFe', 2, 1, 0, -1], alSiTe = ['lSiTe', 2, 1, 0, -1], alSeFi = ['lSeFi', 2, 1, 0, -1], alSeTi = ['lSeTi', 2, 1, 0, -1];
alFiNe = ['lFiNe', 2, 1, 0, -1], alFiSe = ['lFiSe', 2, 1, 0, -1], alFeNi = ['lFeNi', 2, 1, 0, -1], alFeSi = ['lFeSi', 2, 1, 0, -1];
alTiNe = ['lTiNe', 2, 1, 0, -1], alTiSe = ['lTiSe', 2, 1, 0, -1], alTeNi = ['lTeNi', 2, 1, 0, -1], alTeSi = ['lTeSi', 2, 1, 0, -1];
// grips
agNi = ['gNi', 2, 1, 0, -1], agNe = ['gNe', 2, 1, 0, -1], agSi = ['gSi', 2, 1, 0, -1], agSe = ['gSe', 2, 1, 0, -1];
agTi = ['gTi', 2, 1, 0, -1], agTe = ['gTe', 2, 1, 0, -1], agFi = ['gFi', 2, 1, 0, -1], agFe = ['gFe', 2, 1, 0, -1];


question_sets = [
	[
		['name', [
			['ru', 'Сравнение когнитивных функций и осей'],
			['en', 'Compare cognitive functions and axes'],
		]],
		['desc', [
			['ru', 'Ne против Ni, Se против Si, Fe против Fi, Te против Ti, FiTe против FeTi, NiSe против NeSi'],
			['en', 'Determine preference Ne vs Ni, Se vs Si, Fe vs Fi, Te vs Ti, FiTe vs FeTi, NiSe vs NeSi'],
		]],
		['cnt_a', 5],
		['cnt_q', 2],
		['questions', [
			[
				['res', [aNe, RA(aNi)]],
				['le', [
					['ru', 'При восприятии информации обращаю внимание на возможности и потенциальные варианты реализации идей (даже если не планирую их реализовывать)'],
					['en', 'Draw attention towards possibilities and different ways of implementing ideas even if not interested in actual implementation while perceiving information'],
				]],
				['ri', [
					['ru', 'При восприятии информации обращаю внимание на символы и образы, что всплывают в моём сознании'],
					['en', 'Draw attention towards internal images and symbols that appear in my head while perceiving information'],
				]],
			],
			[
				['res', [aNe, RA(aNi)]],
				['le', [
					['ru', 'Мои идеи разнообразны'],
					['en', 'My ideas are diverse'],
				]],
				['ri', [
					['ru', 'Мои идеи - углубленное рассмотрение одной идеи'],
					['en', 'My ideas are in-depth examination of one idea'],
				]],
			],
			[
				['res', [aNe, RA(aNi)]],
				['le', [
					['ru', 'Знаю немного о многом'],
					['en', 'Know a little about a lot'],
				]],
				['ri', [
					['ru', 'Знаю много о малом'],
					['en', 'Know a lot about a little'],
				]],
			],
			[
				['res', [aNe, RA(aNi)]],
				['le', [
					['ru', 'У меня в основном нет плана, в приоритете скорость реагирования'],
					['en', 'I usually favor reaction speed over planning'],
				]],
				['ri', [
					['ru', 'У меня в основном есть план, в приоритете анализирование'],
					['en', 'I usually favor planning over reaction speed'],
				]],
			],
			[
				['res', [aNe, RA(aNi)]],
				['le', [
					['ru', 'При выражении своего мнения или позиции чаще использую ассоциации'],
					['en', 'When expressing my opinion or position, I often use associations'],
				]],
				['ri', [
					['ru', 'При выражении своего мнения или позиции чаще пытаюсь более дословно передать суть через воссоздание своих внутренних образов'],
					['en', 'When expressing my opinion or position, I often try to convey the essence more literally through the recreation of my internal images'],
				]],
			],
			[
				['res', [aNe, RA(aNi)]],
				['le', [
					['ru', 'У меня есть склонность перескакивать с темы на тему (Пример: мне сложно сосредоточиться на чем-то одном, не хочу зацикливаться на этом)'],
					['en', 'I tend to leap over things (for example I can\'t concentrate on one thing, not willing to fixate on that thing)'],
				]],
				['ri', [
					['ru', 'У меня есть склонность развивать диалог по одному руслу (Пример: после прекращения дискуссии могу продолжить говорить об этом после большого перерыва, когда мой собеседник уже забыл об этом)'],
					['en', 'I tend to stay on-topic (for example I can resume the talk even if my interlocutor has already forgotten about it)'],
				]],
			],
			[
				['res', [aNe, RA(aNi)]],
				['le', [
					['ru', 'В стрессе представляю миллионы разных способов того, что может пойти не так и волнуюсь о том, что будет, если это случится'],
					['en', 'While stressed I imagine a lot of possibilities of things going wrong and worry about them happening'],
				]],
				['ri', [
					['ru', 'В стрессе начинаю проигрывать в голове некоторые ситуации с плохим исходом и более-менее уверен, что это произойдет'],
					['en', 'While stressed I "replay" some bad situations and confident that they will happen'],
				]],
			],
			[
				['res', [aSi, RA(aSe)]],
				['le', [
					['ru', 'Больше наблюдаю, чем реагирую'],
					['en', 'Prefer observing to taking action'],
				]],
				['ri', [
					['ru', 'Больше реагирую, чем наблюдаю'],
					['en', 'Prefer taking action to observing'],
				]],
			],
			[
				['res', [aSi, RA(aSe)]],
				['le', [
					['ru', 'План моего будущего построен на опыте прошлого'],
					['en', 'My future is built on top of my past'],
				]],
				['ri', [
					['ru', 'У меня нет плана будущего, живу в настоящем'],
					['en', 'Don\'t generally have a future plan and live in the moment'],
				]],
			],
			[
				['res', [aSi, RA(aSe)]],
				['le', [
					['ru', 'Учусь на своих ошибках'],
					['en', 'I learn on my mistakes'],
				]],
				['ri', [
					['ru', 'Стараюсь забыть о своих неудачах'],
					['en', 'Try to forget my misses'],
				]],
			],
			[
				['res', [aSi, RA(aSe)]],
				['le', [
					['ru', 'В основном делаю всё одинаково, могу документировать свои действия'],
					['en', 'I have the ability to log actions because of doing things in similar manner'],
				]],
				['ri', [
					['ru', 'Забываю, какие действия были выполнены, и не стану записывать последовательность'],
					['uk', 'Забуваю які дії були виконані, і не стану записувати послідовність'],
					['en', 'Forget action sequence and would not log actions'],
				]],
			],
			[
				['res', [aSi, RA(aSe)]],
				['le', [
					['ru', 'Сначала думаю, потом действую'],
					['uk', 'Спочатку думаю, потім роблю'],
					['en', 'Think before do'],
				]],
				['ri', [
					['ru', 'Сначала действую, потом думаю'],
					['uk', 'Спочатку роблю, потім думаю'],
					['en', 'Do before think'],
				]],
			],
			[
				['res', [aSi, RA(aSe)]],
				['le', [
					['ru', 'Лучше получить более сильное удовольствие, но потом'],
					['uk', 'Краще отримати сильніше задоволення, але потім'],
					['en', 'Can delay having fun for having more of it'],
				]],
				['ri', [
					['ru', 'Не откладывай на завтра то, что может принести удовольствие уже сегодня'],
					['uk', 'Не відкладай на завтра те, що може принести задоволення вже сьогодні'],
					['en', 'Don\'t delay having fun'],
				]],
			],
			[
				['res', [aSi, RA(aSe)]],
				['le', [
					['ru', 'Буду повторять те действия, которые уже принесли мне радость'],
					['uk', 'Повторюватиму ті дії, що вже принесли мені радість'],
					['en', 'Going to repeat actions that gave me happiness in the past'],
				]],
				['ri', [
					['ru', 'Ищу новые методы получения удовольствия'],
					['uk', 'Шукаю нові методи отримання задоволення'],
					['en', 'Always looking for new experiences'],
				]],
			],
			[
				['res', [aFi, RA(aFe)]],
				['le', [
					['ru', 'Мои ценности имеют для меня первостепенную важность, но я не всегда стремлюсь отчаянно бороться за них и высказывать. Главное, что они есть у меня'],
					['uk', 'Мої цінності мають для мене першорядну важливість, але я не завжди прагну відчайдушно боротися за них та висловлювати. Головне, що вони є в мене'],
					['en', 'My values are of the utmost importance but I won\'t always desperately fight for them. The main point is that I have these values'],
				]],
				['ri', [
					['ru', 'Могу не соглашаться со всеми ценностями, принятыми в обществе, но знаю о них достаточно и чувствую, когда кто-то их не придерживается'],
					['uk', 'Можу не погоджуватись з усіма цінностями, прийнятими в суспільстві, але знаю про них достатньо і відчуваю коли хтось їх не дотримується'],
					['en', 'May disagree with some social values but know enough about them to notice anyone breaking them'],
				]],
			],
			[
				['res', [aFi, RA(aFe)]],
				['le', [
					['ru', 'Собственные чувства и личные ценности для меня гораздо важнее, чем чужие, когда принимаю решение'],
					['uk', 'Власні почуття і особисті цінності для мене набагато важливіші за чужі при прийнятті рішення'],
					['en', 'Value my feelings and personal values more then others\' ones when coming to a decision'],
				]],
				['ri', [
					['ru', 'Чувства и личные ценности других для меня в некоторой степени важнее, чем собственные, когда принимаю решение'],
					['uk', 'Почуття та особисті цінності інших для мене в певній мірі важливіші за власні при прийнятті рішення'],
					['en', 'Value others\' feelings and values somewhat more than mine when comeing to a decision'],
				]],
			],
			[
				['res', [aFi, RA(aFe)]],
				['le', [
					['ru', 'Осознаю себя больше, чем других'],
					['uk', 'Усвідомлюю себе краще, ніж інших'],
				]],
				['ri', [
					['ru', 'Понимаю кого угодно лучше, чем себя'],
					['uk', 'Розумію будь-кого краще за себе'],
				]],
			],
			[
				['res', [aFi, RA(aFe)]],
				['le', [
					['ru', 'Всегда придерживаюсь внутреннего морального кодекса, и пропускаю через собственный опыт различные ситуации'],
					['uk', 'Завжди дотримуюсь внутрішнього морального кодекса і пропускаю різні ситуації через власний досвід'],
					['en', 'Always follow internal moral code and process various cases through my personal experience'],
				]],
				['ri', [
					['ru', 'Мои принципы зависят от ситуации. Могу изменить их, если это улучшит обстановку'],
					['uk', 'Мої принципи залежать від ситуації. Я можу змінити їх, якщо це покращить обстановку'],
					['en', 'My moral principles depend on the case and I can change them if this can improve the situation'],
				]],
			],
			[
				['res', [aFi, RA(aFe)]],
				['le', [
					['ru', 'Я - уникальный человек'],
					['uk', 'Я - унікальна людина'],
					['en', 'I am the unique person'],
				]],
				['ri', [
					['ru', 'Хочу вписаться в общество'],
					['uk', 'Хочу вписатися в суспільство'],
					['en', 'I would like to fit in the society'],
				]],
			],
			[
				['res', [aFi, RA(aFe)]],
				['le', [
					['ru', 'Кажется, будто все меня замечают'],
					['uk', 'Здається, що мене всі помічають'],
					['en', 'Feel like everyone notices me'],
				]],
				['ri', [
					['ru', 'Кажется, будто меня никто не замечает'],
					['uk', 'Здається, що мене ніхто не помічає'],
					['en', 'Feel like no one notices me'],
				]],
			],
			[
				['res', [aFi, RA(aFe)]],
				['le', [
					['ru', 'Стараюсь не подстраиваться под людей'],
					['uk', 'Стараюсь не підлаштовуватися під людей'],
					['en', 'Don\'t try to adjust myself to others'],
				]],
				['ri', [
					['ru', 'Отдельная маска на каждого человека или группу'],
					['uk', 'Окрема маска для кожної людини або групи'],
					['en', 'I have a "mask" for everyone'],
				]],
			],
			[
				['res', [aTe, RA(aTi)]],
				['le', [
					['ru', 'Навожу порядок вокруг'],
					['uk', 'Наводжу порядок навкруги'],
					['en', 'Put surroundings in order'],
				]],
				['ri', [
					['ru', 'Навожу порядок в себе, могу быть неряшливым человеком'],
					['uk', 'Наводжу порядок у собі, можу бути неохайною людиною'],
					['en', 'Put myself in order'],
				]],
			],
			[
				['res', [aTe, RA(aTi)]],
				['le', [
					['ru', 'Беру на себя ответственность и отвожу приказы. Строгий и контролирующий лидер'],
					['uk', 'Беру на себе відповідальність і віддаю накази. Строгий та контролюючий лідер'],
					['en', 'I take responsibility and take orders. Strict and supervisory leader'],
				]],
				['ri', [
					['ru', 'В контроле не заинтересован. Сдержанный и менее жёсткий лидер'],
					['uk', 'Не зацікавлений у контролі. Зібраний і менш жорсткий лідер'],
					['en', 'Not that interested in controlling. Reserved and less rigid leader'],
				]],
			],
			[
				['res', [aTe, RA(aTi)]],
				['le', [
					['ru', 'Моё мышление более вербально/словесно и объективно'],
					['uk', 'Моє мислення більш вербальне/словесне і об\'єктивне'],
					['en', 'My way of thinking is more verbal/wordy and objective'],
				]],
				['ri', [
					['ru', 'Моё мышление более абстрактно/субъективно и невербально'],
					['uk', 'Моє мислення більш абстрактне/невербальне і суб\'єктивне'],
					['en', 'My way of thinking is more abstract/subjective and non-verbal'],
				]],
			],
			[
				['res', [aTe, RA(aTi)]],
				['le', [
					['ru', 'Моё мышление работает относительно внешних принципов (универсально)'],
					['uk', 'Моє мислення працює відносно зовнішніх принципів (універсально)'],
					['en', 'My thinking works according to external principles (universal)'],
				]],
				['ri', [
					['ru', 'Моё мышление работает относительно личной логической системы (ситуативно)'],
					['uk', 'Моє мислення працює відносно особистої логічної системи (ситуативно)'],
					['en', 'My thinking works according to the personal logical system (situational)'],
				]],
			],
			[
				['res', [aTi, RA(aTe)]],
				['le', [
					['ru', 'Знания - способ быть компетентным. Могу накапливать знания обо всем, но не факт что буду их когда-либо использовать'],
					['uk', 'Знання - спосіб бути компетентним. Можу накопичувати знання про все, але не факт що буду їх коли-небудь використовувати'],
					['en', 'Knowledge is the way to be qualified. I can gain knowledge about everything but I don\'t know whether it will be used or not'],
				]],
				['ri', [
					['ru', 'Знания - инструмент, который можно использовать. Фильтрую знания на факт их полезности лично для меня'],
					['uk', 'Знання - інструмент, яким можна користуватися. Фільтрую знання на факт їх користі особисто для мене'],
					['en', 'Knowledge is a tool which can be used. I filter it for my personal usefulness'],
				]],
			],
			[
				['res', [aTe, RA(aTi)]],
				['le', [
					['ru', 'Во время дискуссии чаще выясняю ситуацию по мере продвижения диалога и оперирую объективными фактами'],
					['uk', 'Під час дискусії частіше з\'ясовую ситуацію по мірі просування діалогу та оперую об\'єктивними фактами'],
					['en', 'Clarify the situation as the dialogue progresses and operate with objective facts while debating'],
				]],
				['ri', [
					['ru', 'Во время дискуссии чаще высказываю своё субъективное мнение и придерживаюсь его'],
					['uk', 'Під час дискусії частіше висловлюю власну суб\'єктивну думку і притримуюсь її'],
					['en', 'I express my subjective opinion and stick to it while debating'],
				]],
			],
			[
				['res', [aTe, RA(aTi)]],
				['le', [
					['ru', 'Вижу в фактах их самостоятельную ценность'],
					['uk', 'Бачу в фактах їх самостійну цінність'],
					['en', 'Facts are vaulable on their own'],
				]],
				['ri', [
					['ru', 'Использую факты для подтверждения собственных теорий или размышлений'],
					['uk', 'Використовую факти задля підтвердження власних теорій або роздумів'],
					['en', 'Use facts to prove my theories'],
				]],
			],
			[
				['res', [aFeTi, RA(aFiTe)]],
				['le', [
					['ru', 'При надобности могу размыть свою идентичность, чтобы влиться в группу'],
					['uk', 'При необхідності можу розмити свою ідентичність щоб влитись у групу'],
					['en', 'I can "blur" my identity if needed to blend in a group'],
				]],
				['ri', [
					['ru', 'Для меня важно быть собой, обладать индивидуальностью'],
					['uk', 'Для мене важливо бути собою, мати індивідуальність'],
					['en', 'I vaule being myself and having individuality'],
				]],
			],
			[
				['res', [aFeTi, RA(aFiTe)]],
				['le', [
					['ru', 'В коллективном обсуждении в первую очередь выясню мнение окружающих людей и постараюсь учесть каждое из них'],
					['uk', 'У колективному обговоренні в першу чергу з\'ясовую думку оточуючих людей і постараюсь враховувати кожну з них'],
					['en', 'First of all I will find out others\' opinions and try to satisfy all of them in collective discussion'],
				]],
				['ri', [
					['ru', 'В коллективном обсуждении в первую очередь выясню, кто что хочет и как мы можем добиться нужных результатов'],
					['uk', 'У колективному обговоренні в першу чергу з\'ясовую хто чого хоче і як ми можемо досягнути потрібних результатів'],
					['en', 'First of all I will find out others\' result wishes and try to find way of achieving desired results in collective discussion'],
				]],
			],
			[
				['res', [aFeTi, RA(aFiTe)]],
				['le', [
					['ru', 'В стрессе чувствую, что мнения других людей приводят только к конфликтам и разрушениям гармонии, поэтому стараюсь разрешить конфликты и в какой-то мере привить остальным людям нормы морали для избежания подобных ситуаций'],
					['uk', 'У стресі я відчуваю, що думки інших людей призводять лише до конфліктів і руйнувань гармонії, тому намагаюся вирішити конфлікти і певною мірою змушую інших людей засвоїти норми моралі, щоб уникнути подібних ситуацій.'],
				]],
				['ri', [
					['ru', 'В стрессе чувствую, что люди вокруг слишком ранимы, что их позиция слишком предвзята, и это мешает мне объективно оценивать ситуацию, поэтому пытаюсь установить систему контроля или продвигать факты для поддержания порядка'],
					['uk', 'У стресі я відчуваю, що люди довкола надто вразливі, що їх позиція надто упереджена, і це заважає мені об\'єктивно оцінювати ситуацію, тому намагаюся встановити систему контролю чи просувати факти для підтримання порядку.'],
				]],
			],
			[
				['res', [aFeTi, RA(aFiTe)]],
				['le', [
					['ru', 'Мир кажется очень живым, а я в нём - маленький вкладчик в этот мир'],
					['uk', 'Світ здається дуже живим, а я в ньому – маленький вкладник у цей світ'],
				]],
				['ri', [
					['ru', 'Мир очень безличный и жёсткий, а я - уязвимый и хрупкий набор потребностей, который должен выживать, чтобы привнести что-то в этот мир'],
					['uk', 'Світ дуже безособовий і жорсткий, а я - вразливий та тендітний набір потреб, який повинен виживати, щоб привнести щось у цей світ'],
				]],
			],
			[
				['res', [aNiSe, RA(aNeSi)]],
				['le', [
					['ru', 'Мои наблюдения основаны на одной точке зрения, которая даёт наибольшую отдачу по отношению к текущей ситуации'],
					['uk', 'Мої спостереження засновані на одній точці зору, яка дає найбільшу віддачу щодо поточної ситуації'],
				]],
				['ri', [
					['ru', 'Мои наблюдения основаны на нескольких перспективах'],
					['uk', 'Мої спостереження ґрунтуються на кількох перспективах'],
				]],
			],
			[
				['res', [aNiSe, RA(aNeSi)]],
				['le', [
					['ru', 'У меня есть тенденция чрезмерно фиксироваться на каких-то объектах, темах или мыслях'],
					['uk', 'У мене є тенденція надмірно фіксуватися на якихось об\'єктах, темах чи думках'],
				]],
				['ri', [
					['ru', 'Нет сильной привязанности к рассматриваемым мною объектам, темам и мыслям, зато есть неплохая широта обзора'],
					['uk', 'Немає сильної прихильності до об\'єктів, що розглядаються мною, тем і думок, зате є непогана широта огляду'],
				]],
			],
			[
				['res', [aNiSe, RA(aNeSi)]],
				['le', [
					['ru', 'Важно сфокусироваться на одном и принимать решения, приносящие пользу здесь и сейчас'],
					['uk', 'Важливо сфокусуватися на одному і приймати рішення, які приносять користь зараз'],
				]],
				['ri', [
					['ru', 'Важно быть осторожным и иногда даже дотошным человеком, чтобы внести свой вклад в систему, которая может быть и не так полезна здесь и сейчас, но безусловно будет таковой в будущем'],
					['uk', 'Важливо бути обережним і іноді навіть прискіпливою людиною, щоб зробити свій внесок у систему, яка може бути і не так корисна зараз, але безумовно буде такою в майбутньому'],
				]],
			],
			[
				['res', [aNiSe, RA(aNeSi)]],
				['le', [
					['ru', 'Стремлюсь представить или обнаружить один путь решения проблемы, построенный на моих различных впечатлениях о вещах'],
					['uk', 'Прагну уявити або виявити один шлях вирішення проблеми, побудований на моїх різних враженнях про речі'],
				]],
				['ri', [
					['ru', 'Стремлюсь обнаружить, сопоставить или понять истинную природу вещей, составляя объединяющие элементы между различными творческими взглядами на вещи'],
					['uk', 'Прагну виявити, зіставити чи зрозуміти справжню природу речей, складаючи об\'єднуючі елементи між різними творчими поглядами на речі'],
				]],
			],
			[
				['res', [aFeTi, RA(aFiTe)]],
				['le', [
					['ru', 'Если бы мне дали строить дом, то сначала был бы разработан план постройки, а потом уже поиск методов реализации'],
					['uk', 'Якби мені дали будувати будинок, то спочатку було б розроблено план будівництва, а потім уже пошук методів реалізації'],
				]],
				['ri', [
					['ru', 'Если бы мне дали строить дом, то были бы использованы уже имеющиеся инструменты'],
					['uk', 'Якби мені дали будувати будинок, то були б використані інструменти, що вже є'],
				]],
			],
		]],
	],
	[
		['name', [
			['ru', 'Опиши головокружение'],
			['en', 'Describe a vertigo'],
			['uk', 'Опиши запаморочення'],
		]],
		['desc', [
			['ru', 'Опиши головокружение и сравни его с четырьмя примерами'],
			['en', 'Describe a vertigo and compare yourself with four examples'],
			['uk', 'Опиши запаморочення та порівняй його з чотирма прикладами'],
		]],
		['cnt_a', 4],
		['cnt_q', 1],
		['questions', [
			[
				['res', [aNeV]],
				['le', [
					['ru', 'Описывая головокружение, привожу подробные ассоциации, связанные с моими ощущениями (Пример: "Головокружение словно черный нимб над головой человека", "Головокружение словно карусель")'],
					['uk', 'Описуючи запаморочення, наводжу докладні асоціації, пов\'язані з моїми відчуттями (Приклад: "Запаморочення як чорний німб над головою людини", "Запаморочення як карусель")'],
				]],
			],
			[
				['res', [aNiV]],
				['le', [
					['ru', 'Описывая головокружение, обращаю внимание на всплывающие в моей голове внутренние образы, мысли, на визуализированные внутренние объекты (Пример: "Когда я представляю головокружение, у меня появляется визуальный образ размытого кистью изображения", "Когда я описывал головокружение, в моей голове всплыла картинка человечка из комикса со звёздочками вокруг своей головы")'],
					['uk', 'Описуючи запаморочення, звертаю увагу на внутрішні образи, думки, що спливають у моїй голові, на візуалізовані внутрішні об\'єкти (Приклад: "Коли я представляю запаморочення, у мене з\'являється візуальний образ розмитого пензлем зображення", "Коли я описував запаморочення, в моїй голові  з\'являється картинка з коміксу зі зірочками навколо своєї голови")'],
				]],
			],
			[
				['res', [aNiV]],
				['le', [
					['ru', 'Описание головокружения вызывает у меня трудности, обычно я просто перечисляю основные физические ощущения (Пример: Голова кружится, болит. Глаза болят. Тошнит)'],
					['uk', 'Опис запаморочення викликає у мене труднощі, зазвичай я просто перераховую основні фізичні відчуття (Приклад: Голова паморочиться, болить. Очі болять. Нудить)'],
				]],
			],
			[
				['res', [aNeV]],
				['le', [
					['ru', 'Описывая головокружение, рассказываю точные подробные физические ощущения, расписывая их до мелочей (Пример: Голова кружится, и небольшая боль в затылке, руки дрожат, сильно тошнит и темнеет в глазах. Иногда становится трудно дышать, хочется прилечь, ноги подкашиваются)'],
					['uk', 'Описуючи запаморочення, розповідаю точні докладні фізичні відчуття, розписуючи їх до дрібниць (Приклад: Голова паморочиться, невеликий біль у потилиці, руки тремтять, сильно нудить і темніє в очах. Іноді стає важко дихати, хочеться прилягти, ноги підкошуються)'],
				]],
			],
		]],
	],
	[
		['name', [
			['ru', 'Лупы'],
			['en', 'Loops'],
			['uk', 'Лупи'],
		]],
		['desc', [
			['ru', 'Лупы - это стрессовое использование первой и третьей функций с игнорированием второй. Луп проявляется при слабом стрессе'],
			['en', 'Loop is a light-stress use of dominant and tertiary functions ignoring auxiliary one'],
			['uk', 'Лупи – це стресовий стан, надмірне використання першої та третьої функцій з ігноруванням другої.'],
		]],
		['cnt_a', 4],
		['cnt_q', 1],
		['questions', [
			[
				['res', [alNiFe, alNiTe]],
				['le', [
					['ru', 'Начинаю терять интерес к своим хобби, не интересуюсь им так, как раньше. То погружаюсь в них, то снова забываю и так по кругу'],
					['uk', 'Починаю втрачати інтерес до своїх хобі, не цікавлюся ним так, як раніше.  То поринаю в них, то знову забуваю і так по колу'],
				]],
			],
			[
				['res', [alNiFe, alNiTe]],
				['le', [
					['ru', 'Приобретаю нигилистический, опустошенный взгляд на мир и людей'],
					['uk', 'Набуваю нігілістичного, спустошеного погляду на світ і людей'],
				]],
			],
			[
				['res', [alNiFe, alNiTe]],
				['le', [
					['ru', 'Теряю связь с внешним миром'],
					['uk', 'Втрачаю зв\'язок із зовнішнім світом'],
					['en', 'Lose connection to external world'],
				]],
			],
			[
				['res', [alNiFe]],
				['le', [
					['ru', 'Слишком много анализирую и делаю из хорошего плохое'],
					['uk', 'Занадто багато аналізую і роблю з хорошого погане'],
					['en', 'Overanalyze things and make bad things out of good ones'],
				]],
			],
			[
				['res', [alNiFe]],
				['le', [
					['ru', 'Начинаю думать, что "ничего не имеет значения" и задаваться вопросом "в чем вообще смысл всего этого?"'],
					['uk', 'Починаю думати, що "нічого не має значення" і задаватися питанням "у чому взагалі сенс всього цього?"'],
				]],
			],
			[
				['res', [alNiFe]],
				['le', [
					['ru', 'Иногда в стрессовом состоянии я пытаюсь учить людей жизни и убеждать их принять другое, удобное для меня мнение "ради его близких" (манипулирую)'],
					['uk', 'Іноді в стресовому стані я намагаюся вчити людей життю і переконувати їх прийняти іншу, зручну для мене думку "заради його близьких" (маніпулюю)'],
				]],
			],
			[
				['res', [alNiFe]],
				['le', [
					['ru', 'Отдаляюсь от людей и отвергаю любую помощь или поддержку'],
					['uk', 'Віддаляюся від людей і відкидаю будь-яку допомогу чи підтримку'],
				]],
			],
			[
				['res', [alNiTe]],
				['le', [
					['ru', 'Начинаю думать, что являюсь неудачником и никогда не смогу жить так, как хочу, либо что этот мир мне противен и это общество насквозь прогнило'],
					['uk', 'Починаю думати, що я є невдахою і ніколи не зможу жити так, як хочу, або що цей світ мені противний і це суспільство наскрізь прогнило'],
				]],
			],
			[
				['res', [alNiTe]],
				['le', [
					['ru', 'Начинаю смотреть на других людей свысока и считать их "непригодными" или просто не соответствующими моим личным стандартам'],
					['uk', 'Починаю дивитися на інших людей зверхньо і вважати їх "непридатними" або просто не відповідають моїм особистим стандартам'],
				]],
			],
			[
				['res', [alNiTe]],
				['le', [
					['ru', 'Начинаю слишком часто пересматривать одни и те же факты и идеи'],
					['uk', 'Починаю надто часто переглядати одні й ті самі факти та ідеї'],
					['en', 'Start reconsidering same facts and ideas'],
				]],
			],
			[
				['res', [alNiTe]],
				['le', [
					['ru', 'Теряю способность мыслить логически и погружаюсь в свои эмоции, что неприятно для меня'],
					['uk', 'Втрачаю здатність мислити логічно і поринаю в свої емоції, що неприємно для мене'],
					['en', 'Lose ability to thing logically and painfully dive into my emotions'],
				]],
			],
			[
				['res', [alNeTi]],
				['le', [
					['ru', 'Чрезмерно фокусируюсь на веселье'],
					['uk', 'Надмірно фокусуюсь на веселощі'],
					['en', 'Overly focused on having fun'],
				]],
			],
			[
				['res', [alNeTi]],
				['le', [
					['ru', 'Нуждаюсь в социальном одобрении и избегаю критики шутками'],
					['uk', 'Потребую соціального схвалення і уникаю критики жартами'],
				]],
			],
			[
				['res', [alNeTi]],
				['le', [
					['ru', 'Становлюсь неорганизованным'],
					['uk', 'Стаю неорганізованим'],
					['en', 'Become disorganised'],
				]],
			],
			[
				['res', [alNeTi]],
				['le', [
					['ru', 'В какой-то степени могу предсказать, как мои слова могут повлиять на других, и пользуюсь этим для того, чтобы повлиять на людей'],
					['uk', 'Якоюсь мірою можу передбачити, як мої слова можуть вплинути на інших, і користуюся цим для того, щоб вплинути на людей'],
				]],
			],
			[
				['res', [alNeTi]],
				['le', [
					['ru', 'Постоянно пытаюсь представить, как выглядела бы моя "идеальная версия"'],
					['uk', 'Постійно намагаюся уявити, як виглядала б моя "ідеальна версія"'],
				]],
			],
			[
				['res', [alNeTi]],
				['le', [
					['ru', 'Постоянно ищу одобрения, но мне всегда недостаточно'],
					['uk', 'Постійно шукаю схвалення, але мені завжди недостатньо'],
				]],
			],
			[
				['res', [alNeTi]],
				['le', [
					['ru', 'Ставлю нужды других людей превыше того, что логично'],
					['uk', 'Ставлю потреби інших людей понад те, що логічно'],
				]],
			],
			[
				['res', [alNeFi]],
				['le', [
					['ru', 'Ставлю себе множество целей для достижения успеха и забрасываю половину из них на полпути'],
					['uk', 'Ставлю собі безліч цілей для досягнення успіху та закидаю половину з них на півдорозі'],
				]],
			],
			[
				['res', [alNeFi]],
				['le', [
					['ru', 'Сильная и необдуманная реакция на предполагаемые "оскорбления"'],
					['uk', 'Сильна та необдумана реакція на передбачувані "образи"'],
				]],
			],
			[
				['res', [alNeFi]],
				['le', [
					['ru', 'Трачу своё время на тяжёлую работу, которая не приносит ни удовольствия, ни пользы, ради образа и ощущения "занятого человека"'],
					['uk', 'Витрачаю свій час на важку роботу, яка не приносить ні задоволення, ні користі, заради образу та відчуття "зайнятої людини"'],
				]],
			],
			[
				['res', [alNeFi]],
				['le', [
					['ru', 'Реализую свои проекты не эффективными, а наиболее быстрыми способами (и часто ошибаюсь из-за этого)'],
					['uk', 'Реалізую свої проекти не ефективними, а найшвидшими способами (і часто помиляюсь через це)'],
				]],
			],
			[
				['res', [alNeFi]],
				['le', [
					['ru', 'Постоянно сравниваю себя с другими'],
					['uk', 'Постійно порівнюю себе з іншими'],
					['en', 'Compare myself with others all the time'],
				]],
			],
			[
				['res', [alNeFi]],
				['le', [
					['ru', 'Пытаюсь добиться цели, хотя на самом деле даже нет уверенности в том, что эта цель на самом деле существует'],
					['uk', 'Намагаюся досягти мети, хоча насправді в мене навіть немає впевненості в тому, що ця мета існує'],
				]],
			],
			[
				['res', [alNeFi]],
				['le', [
					['ru', 'Перестаю заботиться о себе, могу не спать и не есть, трачу всю энергию на работу'],
					['uk', 'Перестаю дбати про себе, можу не спати і не їсти, витрачаю всю енергію на роботу'],
				]],
			],
			[
				['res', [alSiTe]],
				['le', [
					['ru', 'Когда кто-то задевает мои чувства, начинаю строить "теории заговора" и считаю, что обидчик был преднамеренно враждебным (даже если очевидно, что это не так)'],
					['uk', 'Коли хтось зачіпає мої почуття, починаю вигадувати "теорії змови" і вважаю, що кривдник був навмисне ворожим (навіть якщо очевидно, що це не так)'],
				]],
			],
			[
				['res', [alSiTe]],
				['le', [
					['ru', 'Придерживаюсь привычного, упираюсь и отвергаю все, что противоречит моему мировоззрению'],
					['uk', 'Дотримуюсь звичного, упираюсь і відкидаю все, що суперечить моєму світогляду'],
				]],
			],
			[
				['res', [alSiTe]],
				['le', [
					['ru', 'Могу отклонять новые концепции, которые кажутся вполне приемлемыми, просто чтобы не иметь проблем со внутренними неудобными чувствами'],
					['uk', 'Можу відхиляти нові концепції, які здаються цілком прийнятними, просто щоб не мати проблем із внутрішніми незручними почуттями'],
				]],
			],
			[
				['res', [alSiTe]],
				['le', [
					['ru', 'Постоянно думаю обо всех ситуациях в прошлом, которые пошли не так и обо всех вещах, которые оказались неправильными'],
					['uk', 'Постійно думаю про всі ситуації в минулому, які пішли не так і про всі речі, які виявилися неправильними'],
				]],
			],
			[
				['res', [alSiTe]],
				['le', [
					['ru', 'Прошлое оказалось наполнено ошибками, поэтому не могу и не хочу двигаться дальше'],
					['uk', 'Минуле виявилося наповненим помилками, тому я не можу і не хочу рухатися далі'],
				]],
			],
			[
				['res', [alSiTe]],
				['le', [
					['ru', 'Новый опыт и ощущения кажутся пугающими, для меня будет лучше остаться в своей комфортной зоне'],
					['uk', 'Новий досвід та відчуття здаються лякаючими, для мене краще залишитися у своїй комфортній зоні'],
				]],
			],
			[
				['res', [alSiTe]],
				['le', [
					['ru', 'Не могу планировать новые вещи и фокусируюсь только на тех задачах, которые могу с лёгкостью выполнить'],
					['uk', 'Не можу планувати нові речі і фокусуюсь лише на тих завданнях, які можу з легкістю виконати'],
				]],
			],
			[
				['res', [alSiFe]],
				['le', [
					['ru', 'Становлюсь непривычно холодным и резко критичным по отношению к близким людям'],
					['uk', 'Стаю незвично холодним і різко критичним по відношенню до близьких людей'],
				]],
			],
			[
				['res', [alSiFe]],
				['le', [
					['ru', 'Не хочу заботиться о чувствах "недостойного" человека, поэтому выясню все его "недостойные" черты'],
					['uk', 'Не хочу дбати про почуття "негідної" людини, тому з\'ясую всі її "негідні" риси'],
				]],
			],
			[
				['res', [alSiFe]],
				['le', [
					['ru', 'Отгораживаюсь от эмоционального багажа других людей и прячусь в свою зону комфорта'],
					['uk', 'Відгороджуюсь від емоційного багажу інших людей і ховаюсь у свою зону комфорту'],
				]],
			],
			[
				['res', [alSiFe]],
				['le', [
					['ru', 'Отказываюсь принимать и прощать себя за ошибки'],
					['uk', 'Відмовляюся приймати та прощати себе за помилки'],
				]],
			],
			[
				['res', [alSiFe]],
				['le', [
					['ru', 'Становлюсь ужасным перфекционистом (и это мешает мне жить)'],
					['uk', 'Стаю жахливим перфекціоністом (і це заважає мені жити)'],
				]],
			],
			[
				['res', [alSiFe]],
				['le', [
					['ru', 'Отказываюсь от собственных чувств и ценностей в пользу интеллекта и логики'],
					['uk', 'Відмовляюся від власних почуттів та цінностей на користь інтелекту та логіки'],
					['en', 'Withdraw my feeling in behalf of logic and intellect'],
				]],
			],
			[
				['res', [alSiFe]],
				['le', [
					['ru', 'Пытаюсь объяснить свой жизненный выбор или свои мысли с ясностью'],
					['uk', 'Намагаюся пояснити свій життєвий вибір чи свої думки з ясністю'],
					['en', 'Try to clearly explain my life decisions or thoughts'],
				]],
			],
			[
				['res', [alTeNi]],
				['le', [
					['ru', 'Слишком быстро воплощаю свои цели в жизни, не обдумываю их и не рассматриваю долгосрочные последствия своих решений'],
					['uk', 'Занадто швидко втілюю свої цілі в житті, не обмірковую їх та не розглядаю довгострокові наслідки своїх рішень'],
				]],
			],
			[
				['res', [alTeNi]],
				['le', [
					['ru', 'Испытываю острую потребность убежать от проблемных ситуаций'],
					['uk', 'Зазнаю гострої потреби втекти від проблемних ситуацій'],
				]],
			],
			[
				['res', [alTeNi]],
				['le', [
					['ru', 'Сосредотачиваюсь на своем имидже и воспринимаю такие вещи, как количество друзей, покупку дорогих вещей и т.п. как подлинные примеры успеха'],
					['uk', 'Зосереджуюсь на своєму іміджі та сприймаю такі речі, як кількість друзів, купівлю дорогих речей, тощо як справжні приклади успіху'],
				]],
			],
			[
				['res', [alTeNi]],
				['le', [
					['ru', 'Избегаю самоанализа из-за страха, что мне не понравится то, что я узнаю'],
				]],
			],
			[
				['res', [alTeNi]],
				['le', [
					['ru', 'Убеждаю себя, что я проницателен, могу и знаю больше остальных для того, чтобы не ощущать собственную неполноценность'],
				]],
			],
			[
				['res', [alTeNi]],
				['le', [
					['ru', 'Прячусь от своих чувств и основываю свой смысл жизни на потворстве своим желаниям'],
				]],
			],
			[
				['res', [alTeNi]],
				['le', [
					['ru', 'Становлюсь нетерпеливым, капризным и вспыльчивым'],
				]],
			],
			[
				['res', [alTeSi]],
				['le', [
					['ru', 'Отключаю внутренний голос и принимаю поспешные жизненные решения'],
				]],
			],
			[
				['res', [alTeSi]],
				['le', [
					['ru', 'Разрываю любые отношения с людьми, которые пытаются давать мне советы или указывать'],
				]],
			],
			[
				['res', [alTeSi]],
				['le', [
					['ru', 'Обвиняю других людей в своих проблемах, дискомфорте'],
				]],
			],
			[
				['res', [alTeSi]],
				['le', [
					['ru', 'Манипулирую данными, чтобы обвинить других в своих собственных негативных чувствах'],
				]],
			],
			[
				['res', [alTeSi]],
				['le', [
					['ru', 'Излишне подозреваю других людей в скрытых намерения и мотивах'],
				]],
			],
			[
				['res', [alTeSi, alFeSi]],
				['le', [
					['ru', 'Не могу учиться на своих прошлых ошибках'],
				]],
			],
			[
				['res', [alTeSi]],
				['le', [
					['ru', 'Формирую преждевременные суждения'],
				]],
			],
			[
				['res', [alSeTi]],
				['le', [
					['ru', 'Гоняюсь за весельем и азартом'],
				]],
			],
			[
				['res', [alSeTi]],
				['le', [
					['ru', 'Преувеличиваю, чтобы выглядеть более впечатляюще'],
				]],
			],
			[
				['res', [alSeTi]],
				['le', [
					['ru', 'Зацикливаюсь на имидже и внешнем восприятии успеха'],
				]],
			],
			[
				['res', [alSeTi]],
				['le', [
					['ru', 'Использую юмор или эмоции для отражения критики'],
				]],
			],
			[
				['res', [alSeTi]],
				['le', [
					['ru', 'Могу импульсивно реагировать'],
				]],
			],
			[
				['res', [alSeTi]],
				['le', [
					['ru', 'Отказываюсь от критического анализа'],
					['en', 'Withdraw critical analysis'],
				]],
			],
			[
				['res', [alSeTi]],
				['le', [
					['ru', 'Присутствует необходимость быть в центре внимания'],
				]],
			],
			[
				['res', [alFeSi]],
				['le', [
					['ru', 'Делаю слишком поспешные выводы'],
				]],
			],
			[
				['res', [alFeSi]],
				['le', [
					['ru', 'Стремлюсь к новому опыту и удовольствиям, чтобы скрыть своё чувство незащищённости или недовольства'],
				]],
			],
			[
				['res', [alFeSi]],
				['le', [
					['ru', 'Создаю драму, чтобы получить кайф от волнения'],
				]],
			],
			[
				['res', [alFeSi]],
				['le', [
					['ru', 'Проецирую вину и дискомфорт на других'],
				]],
			],
			[
				['res', [alFeSi]],
				['le', [
					['ru', 'Появляется множества случайных и поверхностных знакомств'],
				]],
			],
			[
				['res', [alFeSi]],
				['le', [
					['ru', 'Манипулирую информацией для обоснования своих выводов'],
				]],
			],
			[
				['res', [alFiNe]],
				['le', [
					['ru', 'Застреваю в своей зоне комфорта'],
				]],
			],
			[
				['res', [alFiNe]],
				['le', [
					['ru', 'Скрываю свою истинную природу от других'],
				]],
			],
			[
				['res', [alFiNe]],
				['le', [
					['ru', 'Чрезмерно избегаю риска'],
					['en', 'Avoid taking risks too much'],
				]],
			],
			[
				['res', [alFiNe]],
				['le', [
					['ru', 'Туннельное зрение: теряю способность представлять другие перспективы, хотя раньше она была'],
				]],
			],
			[
				['res', [alFiNe]],
				['le', [
					['ru', 'Слишком много думаю о прошлом'],
					['en', 'Overthink my past'],
				]],
			],
			[
				['res', [alFiNe]],
				['le', [
					['ru', 'Становлюсь чрезмерно самокритичным'],
				]],
			],
			[
				['res', [alFiNe]],
				['le', [
					['ru', 'Слишком сильно концентрируюсь на своих ценностях'],
				]],
			],
			[
				['res', [alSeFi]],
				['le', [
					['ru', 'Выбираю лёгкий путь вместо долгосрочного, который принесёт долгосрочное значение'],
				]],
			],
			[
				['res', [alSeFi]],
				['le', [
					['ru', 'Становлюсь упрямым и требовательным'],
				]],
			],
			[
				['res', [alSeFi]],
				['le', [
					['ru', 'Появляется напористость и агрессия, чтобы защитить свое эго'],
				]],
			],
			[
				['res', [alSeFi]],
				['le', [
					['ru', 'Хочется сразу выполнить все дела, которые у меня есть'],
				]],
			],
			[
				['res', [alSeFi]],
				['le', [
					['ru', 'Теряю связь с тем, что важно лично для меня'],
				]],
			],
			[
				['res', [alSeFi]],
				['le', [
					['ru', 'Скрыто управляю другими и верю в то, что все остальные слишком ленивы и медлительны'],
				]],
			],
			[
				['res', [alSeFi]],
				['le', [
					['ru', 'Основываю свою самооценку на внешних достижениях'],
				]],
			],
			[
				['res', [alFiSe]],
				['le', [
					['ru', 'Жалуюсь на сложные ситуации, но никак их не решаю'],
				]],
			],
			[
				['res', [alFiSe]],
				['le', [
					['ru', 'Появляется способность мыслить, выходя за рамки каких-либо предопределенных способностей человеческого существа'],
				]],
			],
			[
				['res', [alFiSe]],
				['le', [
					['ru', 'Появляется склонность к непринятию "стадного мнения" без причины'],
				]],
			],
			[
				['res', [alFiSe]],
				['le', [
					['ru', 'Утрачиваю связь со своим обычно реалистичным, прагматичным взглядом на вещи'],
				]],
			],
			[
				['res', [alFiSe]],
				['le', [
					['ru', 'Подгоняю факты под шаблон, даже если в этом нет смысла'],
				]],
			],
			[
				['res', [alFiSe]],
				['le', [
					['ru', 'Появляется паранойя и страх будущего'],
				]],
			],
			[
				['res', [alFiSe]],
				['le', [
					['ru', 'Развивается чувство беспокойства по поводу своей способности справляться с будущим'],
				]],
			],
			[
				['res', [alFeNi]],
				['le', [
					['ru', 'Не могу терпеть одиночество'],
					['en', 'Can\'t stand loneliness'],
				]],
			],
			[
				['res', [alFeNi]],
				['le', [
					['ru', 'Гоняюсь за эмоциональными подъёмами и острыми ощущениями, не обращая внимания на долгосрочные последствия'],
				]],
			],
			[
				['res', [alFeNi]],
				['le', [
					['ru', 'Мой выбор "фактов" для подтверждения своих суждений несерьёзный'],
				]],
			],
			[
				['res', [alFeNi]],
				['le', [
					['ru', 'Делаю поспешные выводы'],
				]],
			],
			[
				['res', [alFeNi]],
				['le', [
					['ru', 'Гоняюсь за поверхностными маркерами успеха и зацикливаюсь на «имидже»'],
				]],
			],
			[
				['res', [alFeNi]],
				['le', [
					['ru', 'Развивается нетерпеливое отношение к людям, особенно к интровертам'],
				]],
			],
			[
				['res', [alFeNi]],
				['le', [
					['ru', 'Могу стать капризным и жестоким человеком'],
				]],
			],
			[
				['res', [alTiNe]],
				['le', [
					['ru', 'Отступаю от мира и у меня появляется неспособность обосновывать свои теории на реальном опыте'],
				]],
			],
			[
				['res', [alTiNe]],
				['le', [
					['ru', 'Появляется стремление или нерешительность пробовать что-то новое'],
				]],
			],
			[
				['res', [alTiNe]],
				['le', [
					['ru', 'Мне крайне не нравится риск'],
				]],
			],
			[
				['res', [alTiNe]],
				['le', [
					['ru', 'Полагаюсь на вредные привычки или комфорт в ущерб своим обязанностям'],
				]],
			],
			[
				['res', [alTiNe]],
				['le', [
					['ru', 'Избегаю человеческие связи, даже когда на самом деле считаю, что они мне нужны'],
				]],
			],
			[
				['res', [alTiNe]],
				['le', [
					['ru', 'Становлюсь "диванным критиком" по многим вопросам, не проверяя их достоверность в окружающем мире'],
				]],
			],
			[
				['res', [alTiNe]],
				['le', [
					['ru', 'Появляется чувство, что я трачу жизнь впустую'],
				]],
			],
			[
				['res', [alTiSe]],
				['le', [
					['ru', 'Мрачный взгляд на будущее'],
				]],
			],
			[
				['res', [alTiSe]],
				['le', [
					['ru', 'Развиваю самоубийственное отношение как оправдание того, что не пытаюсь и не упорствую'],
				]],
			],
			[
				['res', [alTiSe]],
				['le', [
					['ru', 'Становлюсь и отшельником'],
				]],
			],
			[
				['res', [alTiSe]],
				['le', [
					['ru', 'Возникает чувство, что никто не может меня понять'],
				]],
			],
			[
				['res', [alTiSe]],
				['le', [
					['ru', 'Отсутствует интерес к новым занятиям и возможностям'],
					['uk', 'Відсутній інтерес до нових знань і можливостей'],
				]],
			],
			[
				['res', [alTiSe]],
				['le', [
					['ru', 'Использую козлов отпущения, чтобы обвинить в своих неудачах'],
					['uk', 'Використовую \'козлів відпущення\', щоб звинуватити у своїх невдачах'],
				]],
			],
			[
				['res', [alTiSe]],
				['le', [
					['ru', 'Становлюсь очень тревожным человеком'],
					['uk', 'Стаю дуже тривожною людиною'],
				]],
			],
		]],
	],
	[
		['name', [
			['ru', 'Грипы'],
			['en', 'Grips'],
			['uk', 'Ґріпи'],
		]],
		['desc', [
			['ru', 'Грип - явление, при котором из-за сильного подавления подчинённой функции она врывается в сознание и "берет контроль", но это не значит что используется только низшая, дом функция не выключается, скорее начинает противостоять низшей вызывая сильный конфликт, + сама дом функция начинает работать нездорóво'],
			['uk', 'Ґріп - явище, за якого через сильний стрес нижча функція вривається у свідомість і \'бере контроль\', при цьому домінантна функція чинить опір, створюючи сильний конфлікт у свідомості, і працює нездоровим чином'],
		]],
		['cnt_a', 4],
		['cnt_q', 1],
		['questions', [
			[
				['res', [agFi]],
				['le', [
					['ru', 'Пытаюсь подавить свои сильные эмоции, стремящиеся вырваться наружу'],
					['uk', 'Намагаюсь пригнічувати свої сильні емоції, що намагаються вирватись назовні'],
				]],
			],
			[
				['res', [agFi]],
				['le', [
					['ru', 'Набрасываюсь на других из-за чувства несправедливости'],
					['uk', 'Накидаюся на інших через відчуття несправедливості'],
				]],
			],
			[
				['res', [agFi]],
				['le', [
					['ru', 'Чувствую, будто меня недооценивают и воспринимают как должное'],
					['uk', 'Відчуваю, що мене недооцінюють і сприймають як належне'],
				]],
			],
			[
				['res', [agFi]],
				['le', [
					['ru', 'Становлюсь очень дезорганизованным человеком'],
					['uk', 'Стаю дуже дизорганізованою людиною'],
				]],
			],
			[
				['res', [agFi]],
				['le', [
					['ru', 'Становится трудно выразить словами свои чувства и эмоции'],
					['uk', 'Стає складно виразити словами свої емоції та почуття'],
				]],
			],
			[
				['res', [agFi]],
				['le', [
					['ru', 'Сильные эмоции, с которыми не получается справляться, охватывают меня целиком'],
					['uk', 'Сильні емоції, з якими не виходить впоратися, цілком мене охоплюють'],
				]],
			],
			[
				['res', [agFi]],
				['le', [
					['ru', 'Чувствую, будто каждый против меня, будто все хотят на меня напасть, оттого и пытаюсь защищаться'],
					['uk', 'Відчуваю, ніби кожен проти мене, ніби всі хочуть напасти на мене, від чого намагаюсь захиститися'],
				]],
			],
			[
				['res', [agFe]],
				['le', [
					['ru', 'Зацикливаюсь на своих отношениях и боюсь, что потеряю близких мне людей'],
					['uk', 'Зациклююсь на своїх відносинах і боюсь що втрачю близьких для мене людей'],
				]],
			],
			[
				['res', [agFe]],
				['le', [
					['ru', 'Чувствую оторванность и изолированность от других'],
					['uk', 'Відчуваю відірваність та ізольованість від інших'],
				]],
			],
			[
				['res', [agFe]],
				['le', [
					['ru', 'Становлюсь эмоционально сверхчувствительным человеком'],
					['uk', 'Стаю емоційно надчутливою людиною'],
				]],
			],
			[
				['res', [agFe]],
				['le', [
					['ru', 'Появляются мысли о том, что никто никогда не сможет меня полюбить'],
					['uk', 'З\'являються думки що мне ніхто ніколи не полюбить'],
				]],
			],
			[
				['res', [agFe]],
				['le', [
					['ru', 'Ищу подтверждения и одобрения от других людей. Иногда появляется привычка хвастаться'],
					['uk', 'Шукаю підтвердження та схвалення від інших людей. Іноді з\'являється звичка хвастатись'],
				]],
			],
			[
				['res', [agFe]],
				['le', [
					['ru', 'Вступаю в нездоровые, зависимые отношения'],
					['uk', 'Вступаю в нездорові, залежні відносини'],
				]],
			],
			[
				['res', [agFe]],
				['le', [
					['ru', 'Становлюсь обидчивым, чувствительным и сентиментальным человеком, что в обычном состоянии для меня непривычно'],
					['uk', 'Стаю образливою, чутливою і сентиментальною людиною, що в звичному стані для мене нехарактерно'],
				]],
			],
			[
				['res', [agTi]],
				['le', [
					['ru', 'Проявляю циничность и саркастичность по отношению к другим людям, теряю свою эмпатию'],
					['uk', 'Проявляю цинічність і саркастичність по відношенню до інших людей, втрачаю свою емпатію'],
				]],
			],
			[
				['res', [agTi]],
				['le', [
					['ru', 'Критикую окружающих и делаю им едкие замечания'],
					['uk', 'Критикую оточуючих і роблю їдкі зауваження'],
				]],
			],
			[
				['res', [agTi]],
				['le', [
					['ru', 'Чувствую себя неловко из-за того, что потерялся контроль над собой, что и позволило собственной тёмной стороне выйти наружу'],
					['uk', 'Почуваюся незручно через утрату контролю над собою, що позволило власній \'темній стороні\' вийти назовні'],
				]],
			],
			[
				['res', [agTi]],
				['le', [
					['ru', 'Ищу абсолютную истину для решения своих проблем'],
					['uk', 'Шукаю абсолютну істину для вирішення власних проблем'],
				]],
			],
			[
				['res', [agTi]],
				['le', [
					['ru', 'Ставлю барьер между собой и близкими'],
					['uk', 'Ставлю бар\'єр між собою та близькими'],
				]],
			],
			[
				['res', [agTi]],
				['le', [
					['ru', 'Очень сильно критикую и разочаровываюсь в себе'],
					['uk', 'Дуже сильно критикую і розчаровуюся в собі'],
				]],
			],
			[
				['res', [agTi]],
				['le', [
					['ru', 'Создаю себе образ другого человека и подавляю свои эмоции ради поддержания этого образа'],
					['uk', 'Створюю собі образ іншої людини і пригнічую власні емоції задля підтримки цього образа'],
				]],
			],
			[
				['res', [agTe]],
				['le', [
					['ru', 'Раздражает нытьё других людей'],
					['uk', 'Дратує ниття інших людей'],
				]],
			],
			[
				['res', [agTe]],
				['le', [
					['ru', 'Цель оправдывает средства'],
					['uk', 'Ціль виправдовує засоби'],
				]],
			],
			[
				['res', [agTe]],
				['le', [
					['ru', 'Если вижу успех другого человека, хочу всем доказать, что я – гораздо лучше'],
					['uk', 'Якщо бачу успіх іншої людини, то хочу всім довести що я - набагато краще'],
				]],
			],
			[
				['res', [agTe]],
				['le', [
					['ru', 'Часами напролёт усердно работаю для достижения цели, напрочь забывая об отдыхе'],
					['uk', 'Безперервно старанно працюю для досягнення цілі, взагалі забуваючи про відпочинок'],
				]],
			],
			[
				['res', [agTe]],
				['le', [
					['ru', 'Многие люди кажутся беспомощными'],
					['uk', 'Багато людей здаються безпорадними'],
				]],
			],
			[
				['res', [agTe]],
				['le', [
					['ru', 'Одержимость быть лучше всех'],
					['uk', 'Одержимість бути краще за всіх'],
				]],
			],
			[
				['res', [agTe]],
				['le', [
					['ru', 'Точно знаю, чего хочу, и обладаю уверенностью в том, что это смогу этого достичь'],
					['uk', 'Точно знаю, чого хочу, і маю впевненість у тому що зможу досягти цього'],
				]],
			],
			[
				['res', [agNi]],
				['le', [
					['ru', 'Начинается поток ужасных неконтролируемых мыслей'],
					['uk', 'Починається потік жахливих неконтролюємих думок'],
				]],
			],
			[
				['res', [agNi]],
				['le', [
					['ru', 'Продумываю в голове самые худшие сценарии развития событий'],
					['uk', 'Продумую в голові найгірші сценарії розвитку подій'],
				]],
			],
			[
				['res', [agNi]],
				['le', [
					['ru', 'Теряю терпимость и легче раздражаюсь'],
					['uk', 'Втрачаю терплячість і легко дратуюсь'],
				]],
			],
			[
				['res', [agNi]],
				['le', [
					['ru', 'Становлюсь очень подозрительным ко всему'],
					['uk', 'Стаю підозрілим до всього'],
				]],
			],
			[
				['res', [agNi]],
				['le', [
					['ru', 'Становлюсь рассеянным и забывчивым человеком'],
					['uk', 'Стаю розсіяною та забудькуватою людиною'],
				]],
			],
			[
				['res', [agNi]],
				['le', [
					['ru', 'Постоянное плохое предчувствие'],
					['uk', 'Постійне передчуття поганого'],
				]],
			],
			[
				['res', [agNi]],
				['le', [
					['ru', 'Отвлекаюсь на тревожные внутренние образы'],
					['uk', 'Відволікаюсь на тривожні внутрішні образи'],
				]],
			],
			[
				['res', [agNe]],
				['le', [
					['ru', 'Теряю способность видеть и замечать детали'],
					['uk', 'Втрачаю здатність бачити і помічати деталі'],
				]],
			],
			[
				['res', [agNe]],
				['le', [
					['ru', 'Становлюсь импульсивным человеком'],
					['uk', 'Стаю імпульсивною людиною'],
				]],
			],
			[
				['res', [agNe]],
				['le', [
					['ru', 'Беспокоюсь обо всех возможных вариантах того, что может пойти не так'],
					['uk', 'Турбуюсь через усі можливі варіанти того, що може піти не так'],
				]],
			],
			[
				['res', [agNe]],
				['le', [
					['ru', 'Придумываю новые непроверенные и непрактичные идеи и возможности в надежде решить проблемы'],
					['uk', 'Вигадую нові неперевірені й непрактичні ідеї та можливості з надією вирішення проблем'],
				]],
			],
			[
				['res', [agNe]],
				['le', [
					['ru', 'Постоянное ощущение опасности и надвигающейся гибели'],
					['uk', 'Постійне відчуття небезпеки та гибелі, що насувається'],
				]],
			],
			[
				['res', [agNe]],
				['le', [
					['ru', 'Чувствую замешательство, панику, тревогу и растерянность'],
					['uk', 'Відчуваю збентеження, паніку, тривогу і розгубленість'],
				]],
			],
			[
				['res', [agNe]],
				['le', [
					['ru', 'Становлюсь менее ответственным, чем обычно'],
					['uk', 'Стаю менш відповідальним, ніж зазвичай'],
				]],
			],
			[
				['res', [agSi]],
				['le', [
					['ru', 'Появляется сильное желание изменить прошлое: "Если бы я поступил(а) иначе, этого бы не произошло..."'],
					['uk', 'З\'являється сильне бажання змінити минуле: "Якби я вчинив(-ла) інакше, цього би не сталося..."'],
				]],
			],
			[
				['res', [agSi]],
				['le', [
					['ru', 'Ощущение, будто упущено нечто хорошее'],
					['uk', 'Відчуття, наче втрачено щось хороше'],
				]],
			],
			[
				['res', [agSi]],
				['le', [
					['ru', 'Неприязнь к "себе из прошлого"'],
					['uk', 'Неприязнь до "себе з минулого"'],
				]],
			],
			[
				['res', [agSi]],
				['le', [
					['ru', 'Становлюсь параноиком; очень критичен ко всему, иногда дотошный'],
					['uk', 'Стаю параноїком; дуже критичний(-а) до всього, іноді прискіпливий(-а)'],
				]],
			],
			[
				['res', [agSi]],
				['le', [
					['ru', 'Слишком осведомлён о своем физическом самочувствии, чувствую себя больным; возможно чрезмерно беспокоюсь о своём здоровье'],
					['uk', 'Занадто усвідомлений у своєму фізичному самопочутті, відчуваю себе хворим; можливо занадто хвилююсь за своє здоров\'я'],
				]],
			],
			[
				['res', [agSi]],
				['le', [
					['ru', 'Часто преувеличиваю проблемы'],
					['uk', 'Часто перебільшую проблеми'],
				]],
			],
			[
				['res', [agSi]],
				['le', [
					['ru', 'Стремлюсь к стабильности для того, чтобы почувствовать безопасность, хотя раньше такого за собой не замечал (только в стрессе)'],
					['uk', 'Прагну стабільності щоб відчути безпеку, хоча раніше за собою такого не помічав (тільки у стресі)'],
				]],
			],
			[
				['res', [agSe]],
				['le', [
					['ru', 'Торопливость и импульсивность'],
					['uk', 'Квапливість та імпульсивність'],
				]],
			],
			[
				['res', [agSe]],
				['le', [
					['ru', 'Паникую и могу впасть в истерику'],
					['uk', 'Панікую і можу впасти в істерику'],
				]],
			],
			[
				['res', [agSe]],
				['le', [
					['ru', 'Слишком налегаю на еду'],
					['uk', 'Надто налягаю на їжу'],
				]],
			],
			[
				['res', [agSe]],
				['le', [
					['ru', 'Уделяю внимание телу (длительный душ/ванные, уход за собой)'],
					['uk', 'Приділяю увагу тілу (тривалий душ/ванна, догляд за собою)'],
				]],
			],
			[
				['res', [agSe]],
				['le', [
					['ru', 'Становлюсь агрессивным: могу сильно повысить голос на человека и нагрубить'],
					['uk', 'Стаю агресивним: можу сильно повисити голос на людину і нагрубити'],
				]],
			],
			[
				['res', [agSe]],
				['le', [
					['ru', 'Тянет на причинение себе вреда (порезы, алкоголь)'],
					['uk', 'Тягне на заподіяння собі шкоди (порізи, алкоголь, тощо)'],
				]],
			],
			[
				['res', [agSe]],
				['le', [
					['ru', 'Совершаю необдуманные поступки (например, трачу деньги на ненужные вещи)'],
					['uk', 'Здійснюю необдумані покупки (наприклад: витрачаю гроші не непотріб'],
				]],
			],
		]],
	],
];
shuffle_questions();


function upd() {
	recalc();
}

function recalc() {
	let str = '';

	let lang = get_lang();

	var cnt = 0;
	var Ni = 0, Ne = 0, Si = 0, Se = 0, Fi = 0, Fe = 0, Ti = 0, Te = 0;
	var NiSe = 0, NeSi = 0, FiTe = 0, FeTi = 0;
	var NiV = 0, NeV = 0, SiV = 0, SeV = 0;
	var lNiFe = 0, lNiTe = 0, lNeFi = 0, lNeTi = 0, lSiFe = 0, lSiTe = 0, lSeFi = 0, lSeTi = 0;
	var lFiNe = 0, lFiSe = 0, lFeNi = 0, lFeSi = 0, lTiNe = 0, lTiSe = 0, lTeNi = 0, lTeSi = 0;
	var gNi = 0, gNe = 0, gSi = 0, gSe = 0, gFi = 0, gFe = 0, gTi = 0, gTe = 0;
	eval(pull_results2);

	eval(tr_helper);
	let txt = [
		['raw', [
			['ru', 'Исходный результат'],
			['en', 'Raw test score'],
			['uk', 'Вихідний результат'],
		]],
		['cog', [
			['ru', 'Счёт когнитивных функций'],
			['en', 'Cognitive functions score'],
			['uk', 'Когнітивні функції'],
		]],
		['group', [
			['ru', 'Группа'],
			['en', 'Group'],
			['uk', 'Група'],
		]],
		['axcmp', [
			['ru', 'Сравнение по осям'],
			['en', 'Axes compare'],
			['uk', 'Порівняння по осях'],
		]],
		['vertigo', [
			['ru', 'Головокружение'],
			['en', 'Vertigo'],
			['uk', 'Запаморочення'],
		]],
		['cogax', [
			['ru', 'Когнитивные оси'],
			['en', 'Cognitive axes'],
			['uk', 'Когнітивні функції'],
		]],
		['INTJ', [
			['ru', 'Стратег'],
			['en', 'Architect'],
			['uk', 'Архітектор'],
		]],
		['INTP', [
			['ru', 'Учёный'],
			['en', 'Logician'],
			['uk', 'Логік'],
		]],
		['ENTJ', [
			['ru', 'Командир'],
			['en', 'Commander'],
			['uk', 'Командир'],
		]],
		['ENTP', [
			['ru', 'Полемист'],
			['en', 'Debater'],
			['uk', 'Полеміст'],
		]],
		['INFJ', [
			['ru', 'Активист'],
			['en', 'Advocate'],
			['uk', 'Адвокат'],
		]],
		['INFP', [
			['ru', 'Посредник'],
			['en', 'Mediator'],
			['uk', 'Посередник'],
		]],
		['ENFJ', [
			['ru', 'Тренер'],
			['en', 'Protagonist'],
			['uk', 'Протагоніст'],
		]],
		['ENFP', [
			['ru', 'Борец'],
			['en', 'Campaigner'],
			['uk', 'Активіст'],
		]],
		['ISTJ', [
			['ru', 'Администратор'],
			['en', 'Logistician'],
			['uk', 'Логіст'],
		]],
		['ISFJ', [
			['ru', 'Защитник'],
			['en', 'Defender'],
			['uk', 'Захисник'],
		]],
		['ESTJ', [
			['ru', 'Менеджер'],
			['en', 'Executive'],
			['uk', 'Керівник'],
		]],
		['ESTP', [
			['ru', 'Консул'],
			['en', 'Consul'],
			['uk', 'Консул'],
		]],
		['ISTP', [
			['ru', 'Виртуоз'],
			['en', 'Virtuoso'],
			['uk', 'Віртуоз'],
		]],
		['ISFP', [
			['ru', 'Артист'],
			['en', 'Adventurer'],
			['uk', 'Авантюрист'],
		]],
		['ESTP', [
			['ru', 'Делец'],
			['en', 'Enterpreneur'],
			['uk', 'Підприємець'],
		]],
		['ESFP', [
			['ru', 'Развлекатель'],
			['en', 'Entertainer'],
			['uk', 'Шоумен'],
		]],
		['type', [
			['ru', 'Тип'],
			['en', 'Type'],
		]],
		['score', [
			['ru', 'Счёт'],
			['en', 'Score'],
		]],
		['loop', [
			['ru', 'Луп'],
			['en', 'Loop'],
		]],
		['grip', [
			['ru', 'Грип'],
			['en', 'Grip'],
		]],
		['cogtype', [
			['ru', 'Тип по когнитивкам'],
			['en', 'Cognitive functions type'],
		]],
		['lgtype', [
			['ru', 'Лупы и грипы'],
			['en', 'Loops and grips'],
		]],
		['probable', [
			['ru', 'Самый вероятный тип имеет наибольший счёт. '],
			['en', 'Best fit type has maximal score. '],
		]],
		['cogans', [
			['ru', 'Наиболее вероятный тип по когнитивным функциям: '],
			['en', 'Best fit type is '],
		]],
		['loopans', [
			['ru', 'Наиболее вероятный луп: '],
			['en', 'Best fit loop is '],
		]],
		['gripans', [
			['ru', 'Наиболее вероятный грип: '],
			['en', 'Best fit grip is '],
		]],
		['rangem', [
			['ru', 'Возможный разброс баллов от -180 до 360. '],
			['en', 'Maximal score range is from -180 to 360. '],
		]],
		['rangelg', [
			['ru', 'Возможный разброс баллов от -7 до 14. '],
			['en', 'Maximal score range is from -7 to 14. '],
		]],
		['besthint', [
			['ru', 'Результат достовернее, если общий разброс больше, максимум больше, отрыв максимума от соседних типов сильнее'],
			['en', 'Better result has wider score range, greater maximum and greateness of maximal score over its neighbors'],
		]],
	];

	str += h3(TR('raw'));
	str += p(TR('cog'));
	str += table([
		tr([th('Ni'), th('Ne'), th('Si'), th('Se'), th('Fi'), th('Fe'), th('Ti'), th('Te'), th(TR('group'))]),
		tr([td( Ni ), td( Ne ), td( Si ), td( Se ), td( Fi ), td( Fe ), td( Ti ), td( Te ), td(TR('axcmp'))]),
		tr([td( NiV), td( NeV), td( SiV), td( SeV), td('--'), td('--'), td('--'), td('--'), td(TR('vertigo'))]),
	]);
	str += p(TR('cogax'))
	str += table([
		tr([th('NiSe'), th('NeSi'), th('FiTe'), th('FeTi')]),
		tr([td( NiSe ), td( NeSi ), td( FiTe ), td( FeTi )]),
	]);

	let namem = new Map();
	namem.set('INTJ', TR('INTJ')); namem.set('INTP', TR('INTP')); namem.set('ENTJ', TR('ENTJ')); namem.set('ENTP', TR('ENTP'));
	namem.set('INFJ', TR('INFJ')); namem.set('INFP', TR('INFP')); namem.set('ENFJ', TR('ENFJ')); namem.set('ENFP', TR('ENFP'));
	namem.set('ISTJ', TR('ISTJ')); namem.set('ISFJ', TR('ISFJ')); namem.set('ESTJ', TR('ESTJ')); namem.set('ESTP', TR('ESTP'));
	namem.set('ISTP', TR('ISTP')); namem.set('ISFP', TR('ISFP')); namem.set('ESTP', TR('ESTP')); namem.set('ESFP', TR('ESFP'));
	let namel = new Map();
	namel.set('INTJ', 'Ni-Fi'); namel.set('INTP', 'Ti-Si'); namel.set('ENTJ', 'Te-Se'); namel.set('ENTP', 'Ne-Fe');
	namel.set('INFJ', 'Ni-Ti'); namel.set('INFP', 'Fi-Si'); namel.set('ENFJ', 'Fe-Se'); namel.set('ENFP', 'Ne-Te');
	namel.set('ISTJ', 'Si-Fi'); namel.set('ISFJ', 'Si-Ti'); namel.set('ESTJ', 'Te-Ne'); namel.set('ESTP', 'Se-Fe');
	namel.set('ISTP', 'Ti-Ni'); namel.set('ISFP', 'Fi-Ni'); namel.set('ESTP', 'Se-Fe'); namel.set('ESFP', 'Se-Te');
	let nameg = new Map();
	nameg.set('INxJ', 'Se grip'); nameg.set('ENxP', 'Si grip'); nameg.set('ISxJ', 'Ne grip'); nameg.set('ESxP', 'Ni grip');
	nameg.set('IxFP', 'Te grip'); nameg.set('ExFJ', 'Ti grip'); nameg.set('IxTP', 'Fe grip'); nameg.set('ExTJ', 'Fi grip');

	// 16cogn + 6axNS + 6axFT + 10cogP + 5loop + 5grip + 14vert
	// cogn: -1 to 2; up to 7 qs -> range -7 to 14 -> apply -112 to 224
	// axNS: -1 to 2; up to 4 qs -> range -4 to  8 -> apply  -24 to 48
	// axFT: -1 to 2; up to 5 qs -> range -5 to 10 -> apply  -30 to 60
	// vert: -1 to 2; up to 1 qs -> range -1 to  2 -> apply  -14 to 28
	// sum:                                        -> apply -180 to 360
	// loop: -1 to 2; up to 7 qs -> range -7 to 14
	// grip: -1 to 2; up to 7 qs -> range -7 to 14

	//   7dom + 5aux + 3ter + 1inf + 6domax + 6auxax + 14domv, 'type'
	let mbti = [
		[7*Ni + 5*Fe + 3*Ti + 1*Se + 6*NiSe + 6*FeTi + 14*NiV, 'INFJ'],
		[7*Ni + 5*Te + 3*Fi + 1*Se + 6*NiSe + 6*FiTe + 14*NiV, 'INTJ'],
		[7*Fi + 5*Ne + 3*Si + 1*Te + 6*FiTe + 6*NeSi + 14*NeV, 'INFP'],
		[7*Ti + 5*Ne + 3*Si + 1*Fe + 6*FeTi + 6*NeSi + 14*NeV, 'INTP'],
		[7*Si + 5*Fe + 3*Ti + 1*Ne + 6*NeSi + 6*FeTi + 14*SiV, 'ISFJ'],
		[7*Si + 5*Te + 3*Fi + 1*Ne + 6*NeSi + 6*FiTe + 14*SiV, 'ISTJ'],
		[7*Fi + 5*Se + 3*Ni + 1*Te + 6*FiTe + 6*NiSe + 14*SeV, 'ISFP'],
		[7*Ti + 5*Se + 3*Ni + 1*Fe + 6*FeTi + 6*NiSe + 14*SeV, 'ISTP'],
		[7*Fe + 5*Ni + 3*Se + 1*Ti + 6*FeTi + 6*NiSe + 14*NiV, 'ENFJ'],
		[7*Te + 5*Ni + 3*Se + 1*Fi + 6*FiTe + 6*NiSe + 14*NiV, 'ENTJ'],
		[7*Ne + 5*Fi + 3*Te + 1*Si + 6*NeSi + 6*FiTe + 14*NeV, 'ENFP'],
		[7*Ne + 5*Ti + 3*Fe + 1*Si + 6*NeSi + 6*FeTi + 14*NeV, 'ENTP'],
		[7*Fe + 5*Si + 3*Ne + 1*Ti + 6*FeTi + 6*NeSi + 14*SiV, 'ESFJ'],
		[7*Te + 5*Si + 3*Ne + 1*Fi + 6*FiTe + 6*NeSi + 14*SiV, 'ESTJ'],
		[7*Se + 5*Fi + 3*Te + 1*Ni + 6*NiSe + 6*FiTe + 14*SeV, 'ESFP'],
		[7*Se + 5*Ti + 3*Fe + 1*Ni + 6*NiSe + 6*FeTi + 14*SeV, 'ESTP'],
	];
	let loop = [
		[lNiFe, 'INFJ'], [lNiTe, 'INTJ'], [lFiNe, 'INFP'], [lTiNe, 'INTP'],
		[lSiFe, 'ISFJ'], [lSiTe, 'ISTJ'], [lFiSe, 'ISFP'], [lTiSe, 'ISTP'],
		[lFeNi, 'ENFJ'], [lTeNi, 'ENTJ'], [lNeFi, 'ENFP'], [lNeTi, 'ENTP'],
		[lFeSi, 'ESFJ'], [lTeSi, 'ESTJ'], [lSeFi, 'ESFP'], [lSeTi, 'ESTP'],
	];
	let grip = [ [gSe, 'INxJ'], [gTe, 'IxFP'], [gFe, 'IxTP'], [gNe, 'ISxJ'], [gTi, 'ExFJ'], [gFi, 'ExTJ'], [gSi, 'ENxP'], [gNi, 'ESxP'], ];
	mbti.sort(function(a,b) { if (a[0] - b[0] != 0) return a[0] - b[0]; return a[1] < b[1];});
	loop.sort(function(a,b) { if (a[0] - b[0] != 0) return a[0] - b[0]; return a[1] < b[1];});
	grip.sort(function(a,b) { if (a[0] - b[0] != 0) return a[0] - b[0]; return a[1] < b[1];});

	let col_names1m = [th(TR('type'))], col_names2m = [th(TR('type'))];
	let col_names1l = [th(TR('type'))], col_names2l = [th(TR('type'))], col_names1g = [th(TR('type'))];
	let col_vals1m = [th(TR('score'))], col_vals2m = [th(TR('score'))];
	let col_vals1l = [th(TR('loop'))], col_vals2l = [th(TR('loop'))], col_vals1g = [th(TR('grip'))];
	let col_empty = [td('')];
	for (let i = 0; i < 8; i += 1) col_empty.push(td(''));
	for (let i = 0; i < 8; i += 1) {
		nm = mbti[i][1], vm = parseInt(mbti[i][0]);
		nl = loop[i][1], vl = parseInt(loop[i][0]);
		ng = grip[i][1], vg = parseInt(grip[i][0]);
		col_names1m.push(td(nm)), col_vals1m.push(td(vm));
		col_names1l.push(td(nl)), col_vals1l.push(td(vl));
		col_names1g.push(td(ng)), col_vals1g.push(td(vg));
	}
	for (let i = 8; i < 16; i += 1) {
		nm = mbti[i][1], vm = parseInt(mbti[i][0]);
		nl = loop[i][1], vl = parseInt(loop[i][0]);
		col_names2m.push(td(nm)), col_vals2m.push(td(vm));
		col_names2l.push(td(nl)), col_vals2l.push(td(vl));
	}

	str += h3(TR('cogtype'));
	str += p(TR('probable') + test_ver);
	str += table([tr(col_names1m), tr(col_vals1m), tr(col_empty), tr(col_names2m), tr(col_vals2m)]);
	str += p(TR('cogans') + bold(mbti[15][1]) + ' (' + namem.get(mbti[15][1]) + ')');
	str += p(TR('rangem') + TR('besthint'));

	str += h3(TR('lgtype'));
	str += p(TR('probable') + test_ver);
	str += table([tr(col_names1l), tr(col_vals1l), tr(col_empty), tr(col_names2l), tr(col_vals2l), tr(col_empty), tr(col_names1g), tr(col_vals1g)]);
	str += p(TR('loopans') + bold(loop[15][1]) + ' (' + namel.get(loop[15][1]) + ')');
	str += p(TR('gripans') + bold(grip[7][1]) + ' (' + nameg.get(grip[7][1]) + ')');
	str += p(TR('rangelg') + TR('besthint'));

	document.getElementById('res').innerHTML = str;
}

function chlang() {
	let lang = get_lang();
	create2(question_sets, lang, test_ver, authors_test, authors_tr, question_count, sheet);
	recalc();  // Initial recalc
}

chlang();  // Initial set lang + recalc
